[[{"sections": [{"title": "False Life/@comment-37236120-20181019145809/@comment-35014500-20181019160710", "level": 1, "content": [{"type": "paragraph", "text": "It would be 1d4+9. "}, {"type": "paragraph", "text": "Each additional level gives you 5 more HP on top of the exising value. So by 9th level you would be gaining 1d4+44 HP (if you wanted to waste your only slot on this anyways)."}, {"type": "paragraph", "text": "This spell is slightly odd in that regard since usually you just gain more dice. However the tradeoff is that you aren't gambling on the extra health, it will always be a minimum of the flat value added."}, {"type": "paragraph", "text": "Edit: corrected 9th level HP value since I calculated it wrong before."}], "images": []}]}, {"sections": [{"title": "D&D 5th Edition Wikia", "level": 1, "content": [{"type": "paragraph", "text": "I've been away for a while and have thus been unable to address this. If you look at the disclaimers on the homepage of the wiki, it notes that not all information is available, due to lack of licensing for 5th edition. As of now (July 2015), Wizards of the Coast has yet to release a license for 5th edition, meaning anything that is NOT made freely available through their website (i.e. the D&D Basic Rules) is most likely protected by copyright. Had I been around earlier, I would have addressed things before so much had changed, but that was not possible."}, {"type": "paragraph", "text": "As my name is on this wiki, I am the one responsible for the content here, and I would much prefer not to anger WotC. There are a few options I can pursue at this moment, and I suppose I should hear from those of you who have been editing the wiki in my absence."}, {"type": "paragraph", "text": "1) I can remove everything that is strictly in the PHB and stick to the D&D Basic Rules alone. This would mean an \"incomplete\" wiki, but it wouldn't have the empty pages (i.e. \"not available; see page XXX in the PHB\") that existed prior."}, {"type": "paragraph", "text": "2) I can change everything that's only in the PHB to page references, as I had before. This means that the wiki is \"complete\" in terms of pages and organization but has a lot of information that is referenced and not actually available here."}, {"type": "paragraph", "text": "3) We can keep things as is and keep what's in the PHB alongside what's in the Basic Rules, for the most \"complete\" wiki. In this case, I will still be keeping a list of what's what, so I can handle things, should WotC or anyone approach the wiki regarding copyright. I may be forced to completely shut down the wiki."}, {"type": "paragraph", "text": "#2 is what I would prefer, as it does not risk copyright problems, but it still provides helpful information. #3 is what you guys would likely prefer, but realize that it does pose risks, and I will not hesitate to take extreme actions, should it come to it. #1 is likely the least preferred, but it would be less clunky than #2, with most of the same information."}, {"type": "paragraph", "text": "I would like to hear from you editors and users what you would prefer before I go about editing everything. I want this wiki to be useful to the people using it, but I also want to be very careful legally, especially considering this still remains the only 5th edition wiki that I know. PLEASE respond, and apologies for the walltext..."}, {"type": "paragraph", "text": "BryanToth (talk) 05:05, July 7, 2015 (UTC)"}, {"type": "paragraph", "text": "Please protect this page. Anyone can spam whatever they want. "}, {"type": "paragraph", "text": "BlazeProgramming"}], "images": []}]}, {"sections": [{"title": "Ice Knife/@comment-36459186-20181207040507/@comment-33788702-20181207135313", "level": 1, "content": [{"type": "paragraph", "text": "No, as it is capable of targetting more than 1 creature (it targets the selected creature and any creature within 5ft of it)"}, {"type": "paragraph", "text": "While it may seem confusing, a good rule of thumb is that if it deals damage  in an AoE, you can't twincast it."}], "images": []}]}, {"sections": [{"title": "Warlock/@comment-26406248-20180723173734", "level": 1, "content": [{"type": "paragraph", "text": "Curse Bringer is gone, along with Superior Pact Weapon. And probably some other stuff I'm not going to research, since losing Curse Bringer destroyed the concept I was working on."}, {"type": "paragraph", "text": "http://media.wizards.com/2017/dnd/downloads/June5UA_RevisedClassOptv1.pdf"}, {"type": "paragraph", "text": "Personally, I don't see the point to Hexblade as written. I'm not suggesting it needs to be OP, but I am suggesting that it should be able to Hex."}, {"type": "paragraph", "text": "[As an aside, I was wondering why Curse Bringer required a Two-Handed weapon, while Hex Warrior requires One-Handed weapons. Generally speaking, class Feats don't conflict with class features.]"}], "images": []}]}, {"sections": [{"title": "Fighter/@comment-14122405-20181203021641", "level": 1, "content": [{"type": "paragraph", "text": "I noticed you guys left out the Knight Martial Archetype from the same UA article as the Arcane Archer and Samurai"}], "images": []}]}]]