[[{"sections": [{"title": "This text is collapsible.", "level": 1, "content": [{"type": "paragraph", "text": "I want to stop seeing an apparently useless statement \"This text is collapsible.\" taking up space at the top of an article. Clicking \"Collapse\" should be unnecessary and is only a partial solution because it leaves a similarly unhelpful instruction in much the same place."}, {"type": "paragraph", "text": "If the thing has a purpose, maybe it has value, but I can't see it."}, {"type": "paragraph", "text": "--- Robin Patterson (Talk) 04:03, December 2, 2018 (UTC)"}], "images": []}]}, {"sections": [{"title": "See Also vs Also See", "level": 1, "content": [{"type": "paragraph", "text": "Should we use \"See also\" or \"Also see\"? Or is either okay?"}, {"type": "paragraph", "text": "My personal \"pet peeve\" is that we don't want people to see \"also\", we would like them to also see; but I know that WP is pretty set in stone to see also. I will bend to consensus, if there is one."}, {"type": "paragraph", "text": "Thanks,"}, {"type": "paragraph", "text": "Zephyrinus 11:19, 8 June 2007 (UTC)"}], "images": []}]}, {"sections": [{"title": "Index", "level": 1, "content": [{"type": "paragraph", "text": "Welcome to the forums! All ideas and questions about genealogy are welcome. Please click:"}, {"type": "list", "elements": [{"text": "Help desk if you want help", "elements": []}, {"text": "Watercooler to float new ideas and see what other ideas are under discussion", "elements": []}, {"text": "Forum in de Nederlandse taal", "elements": []}]}, {"type": "paragraph", "text": "We have many more forum groups than those three. Initial ideas have been discussed elsewhere and may be developed on this page's talk page, and comments and more ideas are welcome there. See also Forum:Talk about Greene County, Ohio for one of the new county forums, the first of possible thousands."}, {"type": "paragraph", "text": "Notes:"}, {"type": "list", "elements": [{"text": "You may have to purge this page to see changes.", "elements": []}, {"text": "Categories can be added to a forum page in the normal way, and will list first if typed right at the top in a separate line.", "elements": []}, {"text": "If more forums seem to need setting up, please see Help:Forums - but a new \"Forum:\" page within an existing \"forum\" just follows forum's editbox procedure", "elements": []}, {"text": "The Old Watercooler was closed off early in 2007. Some of its items were copied to pages here for ongoing discussion. What was left of it became its \"Archive 3\". See:", "elements": [{"text": "Genealogy:Watercooler/Archive 1 - last item 12 January 2006", "elements": []}, {"text": "Genealogy:Watercooler/Archive 2 - dates range from December 2005 to September 2006 apart from one reply dated December 2006", "elements": []}, {"text": "Genealogy:Watercooler/Archive 3 - the leftovers, including some really old material of enduring value; most new items started in or after late August 2006", "elements": []}, {"text": "and/or specifically-named pages (linked from paragraphs on one of those)", "elements": []}]}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/genealogy/images/5/5e/180px-Sasha_Kopf%27s_Celtic_knot_ring.jpg/revision/latest/scale-to-width-down/100?cb=20081015194258"}]}]}, {"sections": [{"title": "What is the kuldevi of Sandilya gotra", "level": 1, "content": [{"type": "paragraph", "text": "I have sandilya gotra but still we don't know witch is our Kuldevi....if you know please reply me."}, {"type": "paragraph", "text": "what is the kuldevi of sandilya gotra..?i have not any knoledge"}], "images": []}]}, {"sections": [{"title": "Cat Terminology: Pioneers vs settlers vs colonists", "level": 1, "content": [{"type": "paragraph", "text": "As I have been looking through the cats, I have seen these terms used, and as more material comes in, there will be lots more of them. But they are all kind of similar in meaning."}, {"type": "paragraph", "text": "To a US audience, these terms imply certain periods of US history, but if we are global, then really we need a term that applies with no implicit meanings to Polynesian colonizers, as much as it does to Europeans landing in NZ, as it does to the US westward expansion/ seizure of American indian lands."}, {"type": "list", "elements": [{"text": "Can we collapse all these meanings to one term- meaning first insertion of an ethnically coherant group into an area previously not inhabited by that group. Settlers or colonizers does it for me. Don't care which one. If there is more than one term, I'd like us to make it clear what the difference is.", "elements": []}]}, {"type": "list", "elements": [{"text": "Note we also have Category:Immigrants to COUNTRY and Category:Emigrants from COUNTRY. As there are millions of these kind of people, these categories may be broken broken down into:", "elements": []}, {"text": "Category:Immigrants to Massachusetts, United States", "elements": []}, {"text": "Category:Emigrants from Yorkshire, England", "elements": []}, {"text": "Category:Immigrants to Plymouth County, Massachusetts, United States", "elements": []}]}, {"type": "list", "elements": [{"text": "Category:Immigrants to Plymouth County, Massachusetts", "elements": []}]}, {"type": "list", "elements": [{"text": "Category:Immigrants to Plymouth County, Massachusetts", "elements": []}, {"text": "Category:Settlers of Plymouth County, Massachusetts", "elements": []}, {"text": "Category:Colonists of Plymouth County, Massachusetts", "elements": []}, {"text": "Category:Pioneers of Plymouth County, Massachusetts", "elements": []}]}], "images": []}, {"title": "Immigrants categories", "level": 2, "content": [{"type": "paragraph", "text": "We already have these, with matching \"Emigrants\" categories and eventually \"Migrants from ... to ...\" categories, all fitting together nicely. If any proposed \"pioneers\" or \"colonists\" or \"settlers\" are at risk of duplicating the \"immigrants\", I don't want them; what's the opposite of \"pioneer\"? Robin Patterson 03:10, 3 December 2007 (UTC)"}], "images": []}, {"title": "\"Resided in ...\"", "level": 2, "content": [{"type": "paragraph", "text": "Already by the time the above was written, we had (at least potentially) the \"Category:Resided in Greene County, Ohio\" group of several thousand categories. Even more reason, I suggest, not to have to consider categories named for pioneers, settlers, plunderers, colonists. Robin Patterson 15:54, 14 July 2008 (UTC)"}, {"type": "paragraph", "text": "But, since writing that, I have seen that Wikipedia has a category for \"early settlers\" of somewhere. Not early by First Nation standards, but lots of people don't care about them. I guess I have no objection to some \"Early settlers in ...\" or \"Early settlers of ...\" categories (matching Wikipedia naming if practicable) as a bit of distinction from all the later settlers; preferably subcategories of \"Resided in ...\". Robin Patterson 09:14, 21 July 2008 (UTC)"}], "images": []}]}, {"sections": [{"title": "First Settlers in Eastern Gregory County", "level": 1, "content": [{"type": "paragraph", "text": "Two sets of my Great Grandparents moved into Eastern Gregory County in 1889 and squatted on land in the Bentz precinct - later named Star Valley twp. My GG Grandfather George Friedrich Bentz and his families as well as My Great Grandfather Georg Balthasar Gall had been living in the Menno, SD area after immigrating from S. Russia. I realize the 1889 date is before the area was formally opened for settlement and would like to learn as much as I can about the conditions under which these families lived."}, {"type": "paragraph", "text": "Joe Thurstenson"}], "images": []}]}, {"sections": [{"title": "Organization", "level": 1, "content": [], "images": []}, {"title": "General", "level": 2, "content": [{"type": "paragraph", "text": "Okay, I have been compiling an index to list all of the help pages here. Upon looking at Category:Help and the Help page, I saw that people may get confused because there are help pages with different names, yet they have the same basic information. Some help pages are categorized, others are not categorized. Some help pages may be categorized too much, as in they are located in the help category, the browse category, and help category subcategories. Basically, you could keep clicking on a category and/or subcategories and go in circles. I bet there's at least 100 help articles out there. And if new people come and participate, they need help. Are they going to read though 100 help pages to know exactly what to do on here? I doubt it. Sure, they may need just a bit of help, but some of the help pages are worded as if only a very experienced user could understand. This goes for both the Help and Genealogy namespaces. I'm confused just looking through those pages while trying to compile a simple index. I've been trying to get some organization going, but I can't do this alone. We really need some organization in this area. What I see is four basic types of pages:"}, {"type": "list", "elements": [{"text": "1. Help - pages that guide/help/tell people how to edit articles", "elements": []}, {"text": "2. Guidelines - pages that tell people what we require them to do while editing (like Naming conventions and birth/death categories, for instance)", "elements": []}, {"text": "3. Wiki Information - pages that give information about this wiki, like who the administrators are, what our goals are, etc.", "elements": []}, {"text": "4. Genealogy - pages that give information, especially to new genealogists, on stuff like abbreviations, record keeping, research tips, etc.", "elements": []}]}, {"type": "paragraph", "text": "What I suggest we do is go though all these articles and just organize them. Simplify them to just a small, well-organized group of articles. We don't need anyone getting confused."}, {"type": "paragraph", "text": "Now, regarding the people pages. We have been having a lot of talk about categorization and formats, but we're basically jumping all around from a lot of different discussions and yet, some articles are being categorized with categories not discussed. What I suggest we do is make one proposal page, perhaps, and like Wikipedia, have a Support/Oppose discussion on how we categorize things. If we come to a decision, we can create a guidelines page to easily inform people what is required of people. If someone disagrees with a way we do something months after the debate, we could have another Support/Oppose discussion and maybe we will make an improvement."}, {"type": "paragraph", "text": "Also, we have pages in which people can request research help. In addition to person talk pages, we have the county queries boards and developing county article groups. Now in the future (I say future for the reason that we have a lot of organization to do before we get into another project) Wikipedia has Portals and WikiProjects. In the future we could have such projects for certain areas of research, if a group of editors develop who work on the same set of articles. If we do this it should be either Portal or Project, not both."}, {"type": "paragraph", "text": "Well, that's all I could think of for now, thanks for reading. -AMK152 00:53, 10 December 2007 (UTC)"}, {"type": "paragraph", "text": "I made separate sections on this discussion page. I brought up all these issues here particuarily because such discussions on organization should be in one place. If the discussion gets to lengthy, such stuff can be archived. Liek I said, we could have a list of proposals and the discussion can be a Support/Oppose kind of thing like on Wikipedia. I just think it's much better to comment on oen page, than to jump to multipel pages to comment stuff. Plus, two different discussions may effect each other. -AMK152 22:18, 15 December 2007 (UTC)"}], "images": []}, {"title": "Wiki information", "level": 2, "content": [{"type": "paragraph", "text": "Discuss general information about this wiki and how to use it."}], "images": []}, {"title": "Help pages", "level": 2, "content": [{"type": "paragraph", "text": "Discuss the organization and what is need/not needed for help pages. Some help pages may need merging, cleaning up, etc."}], "images": []}, {"title": "Regarding use of wiki", "level": 3, "content": [{"type": "paragraph", "text": "Discuss help pages for people using the wiki."}], "images": []}, {"title": "Proposal: Surname Help", "level": 4, "content": [{"type": "paragraph", "text": "At the Help:Surname article I just created, I listed 4 pages regarding the use of surnames. (There could be more, I'll keep looking around) All four of those pages are small enough to be merged together and placed on the Help:Surname article. It is better to have all the surname Help information in one place. It could even be organized and worded so that all people could understand it. Newcomers arn't going to want to go and look at four different pages on the same subject. -AMK152 22:38, 15 December 2007 (UTC)"}, {"type": "list", "elements": [{"text": "Support", "elements": []}]}, {"type": "list", "elements": [{"text": "Sounds Good Will 00:04, 16 December 2007 (UTC)", "elements": []}, {"text": "Support -AMK152 00:20, 16 December 2007 (UTC)", "elements": []}, {"text": "One place to get help on a subject sounds good to me. I don't know if it is the case here, but in the future there could be a use for a split if there arose lots of complexity or debate about the scheme, in which case there might be need for a \"Surname scheme\" to distill down the theory of the structure into a short description which formally defines the guidelines for Surname use on this wikia. ~ Phlox 17:53, 18 December 2007 (UTC)", "elements": []}, {"text": "Support Bill 05:14, 30 December 2007 (UTC)", "elements": []}]}, {"type": "list", "elements": [{"text": "Oppose", "elements": []}]}, {"type": "list", "elements": [{"text": "Neutral", "elements": []}]}], "images": []}, {"title": "Regarding Genealogy research", "level": 3, "content": [{"type": "paragraph", "text": "Discuss help pages for people wantign to know how to research/what to do/ etc."}], "images": []}, {"title": "Guidelines", "level": 2, "content": [{"type": "paragraph", "text": "Discuss requirements of pages in this wiki."}], "images": []}, {"title": "Standardization of Surname categories", "level": 3, "content": [{"type": "list", "elements": [{"text": "This article: Genealogy:Surname category template says that there are three different ways to make a surname category. I believe we should have a standard of one.", "elements": []}, {"text": "1. Ideal", "elements": []}, {"text": "2. Short easy", "elements": []}, {"text": "3. Infobox", "elements": []}]}, {"type": "list", "elements": [{"text": "Infobox - all the basic information can be stored on the infobox rather than having long lists that take up more space like the 1 and 2 methods contain section headings that mostly appear blank on the site. If someone wanted to go ahead and add information about a surname, they would make their own headings. Besides, there may not even be a lot of information. If there is a family who lives in a certain place, they have their own article where the information goes, like the Eldert family of New Netherlands. There are several other Eldert families of different places, and all this information isn't taking up too much space in Category:Eldert Surname. In fact, there isn't any information on the surname there. If there was, it wouldn't be much. Most information would be place on the families by location pages. -AMK152 04:29, 30 December 2007 (UTC)", "elements": []}]}], "images": []}, {"title": "Categorization", "level": 2, "content": [{"type": "paragraph", "text": "Discuss how things should be categorized."}], "images": []}, {"title": "People pages", "level": 2, "content": [{"type": "paragraph", "text": "Discuss people pages. This could also develop guidelines."}], "images": []}, {"title": "Proposal: Use of c, aft, bef", "level": 3, "content": [{"type": "paragraph", "text": "We have been using these mainly as a format, although I have seen otherwise. I havn't seen really any discussion, but it wouldn't hurt to discuss this, jsut so we can have a basic guideline to follow as newcomers start contributing. I will create a list of guidelines (or index, perhaps). As per Genealogy:Page names it is stated \"it doesn't really matter what you use, all the above are OK, BUT standardizing on 'c' simplifies the hunt for articles.\" This is why I am bringing it up. The reccommendations on that article I propose to be a guideline:"}, {"type": "list", "elements": [{"text": "Use \"c\" for circa instead of circa, about ,abt, etc.", "elements": []}, {"text": "Use \"aft\" for after, later than, etc.", "elements": []}, {"text": "Use \"bef\" for before, earlier than, etc.", "elements": []}, {"text": "No spaces between the c, aft, bef and the dates (Use John Smith (c1850-bef1920) instead of John Smith (c 1850-bef 1920)", "elements": []}, {"text": "No spaces between the dates and the dash. Use (1900-1985) instead of (1900 - 1985)", "elements": []}]}, {"type": "list", "elements": [{"text": "Support", "elements": []}]}, {"type": "list", "elements": [{"text": "Support -AMK152 00:20, 16 December 2007 (UTC)", "elements": []}, {"text": "Support - Will 05:14, 16 December 2007 (UTC)", "elements": []}, {"text": "I support the idea about normalization of notation. On the other hand, I have a great deal of ambivalence about what goes into this portion of the name. For example, I am still unconvinced that death date should be mandatory. It seems to me it just creates more reason for people to be renaming articles. ~ Phlox 17:59, 18 December 2007 (UTC)", "elements": []}, {"text": "Same qualified support as Phlox's. See Genealogy talk:Page names. Robin Patterson 22:43, 1 January 2008 (UTC)", "elements": []}]}, {"type": "list", "elements": [{"text": "Oppose", "elements": []}]}, {"type": "list", "elements": [{"text": "Neutral", "elements": []}]}], "images": []}, {"title": "Redirects", "level": 2, "content": [{"type": "paragraph", "text": "Problem: We have alot of people articles out there that are uncategorized. Thus, they are not indexed by Surname, birth/death places/years, etc. If all these articles were categorized with these, there would be hardly any trouble finding them through the indexes."}, {"type": "paragraph", "text": "Solution: We need to find all articles that do not have their needed categories. So we go to Special:Uncategorizedpages and find all people there and categorize them. But, this brings us to the following problem:"}, {"type": "paragraph", "text": "Problem: Bob Smith's article is already categorized with his birth and death years and Mary Smith's article is already categorized with \"Smith Surname.\" So, Bob needs a surname category and Mary needs her birth and death year categories. But, they are already categorized with something, so they won't be found here: Special:Uncategorizedpages."}, {"type": "paragraph", "text": "Solution: Special:Allpages lists every article. So, we could simply go through Special:Allpages and click on every article and make sure they have what they need."}, {"type": "paragraph", "text": "Problem: However, there is so many year, location, and other articles that they are in the way of us accomplishing our goal to. We could we do?"}, {"type": "paragraph", "text": "Solution: Make a list of all people articles on one page."}, {"type": "paragraph", "text": "Problem: Once we make the list, what about the articles that arn't properly named? Such as Jane Smith (1872 - 1955) and Joey smith (before 1833-after 1910)"}, {"type": "paragraph", "text": "Solution: Move all the articles to their proper location."}, {"type": "paragraph", "text": "Problem: We must go through our people article list and fix all the links to each person. Double redirects. Triple redirects. Quadruple redirects. Also the following problem:"}, {"type": "paragraph", "text": "Jane Smith (c1872 - 1955) is moved to Jane Smith (c1872-1955)"}, {"type": "paragraph", "text": "Jane had 12 children. Go to each of the children's pages and fix their mother's link. Go to Jane's husband's page and fix the spouse link. Go to Jane's parents pages and fix the link. Jane's link is on her sister and brother's pages. Fix them. Okay, now, we got that fixed."}, {"type": "paragraph", "text": "Then, Jane's great grandson discovers this site and starts creating pages and links that refer to \"Jane Smith (1872 - 1955).\" So, we must fix the redirects again. Go to there and change it to it's proper location."}, {"type": "paragraph", "text": "The only solution to prevent this is delete the redirects:"}, {"type": "list", "elements": [{"text": "Jane Smith (before 1880 - 1955)", "elements": []}, {"text": "Jane Smith (about 1870 - 1955)", "elements": []}, {"text": "Jane Smith (c1870 - 1955)", "elements": []}, {"text": "Jane Smith (c1872 - 1955)", "elements": []}]}, {"type": "paragraph", "text": "Now we don't have thousands of redirects that may create chaos and confusion, just one page:"}, {"type": "list", "elements": [{"text": "Jane Smith (c1872-1955)", "elements": []}]}, {"type": "paragraph", "text": "Now Jane's great grandson goes to this wiki and makes their page:"}, {"type": "paragraph", "text": "Tim Johnson (1967)"}, {"type": "paragraph", "text": "and on their page the make a list of their ancestors, including:"}, {"type": "list", "elements": [{"text": "Jane Smith (c1872 - 1955)", "elements": []}]}, {"type": "paragraph", "text": "But it will show up in red since we delted that particualr redirect! And Jane's great grandson is positive that Jane has a page here. Checks again, fixes link so that it says:"}, {"type": "paragraph", "text": "Jane Smith (c1872-1955)"}, {"type": "paragraph", "text": "There. Now that page is the proper page. Then Jane's great grandson discovers a document and moves the page to here:"}, {"type": "paragraph", "text": "Jane Smith (1874-1955)"}, {"type": "paragraph", "text": "If we hadn't deleted those redirects we would have the following:"}, {"type": "list", "elements": [{"text": "Jane Smith (before 1880 - 1955)", "elements": []}, {"text": "Jane Smith (about 1870 - 1955)", "elements": []}, {"text": "Jane Smith (c1870 - 1955)", "elements": []}, {"text": "Jane Smith (c1872 - 1955)", "elements": []}, {"text": "Jane Smith (c1872-1955)", "elements": []}]}, {"type": "paragraph", "text": "Gotta fix those 5 double redirects."}, {"type": "paragraph", "text": "Oops! her great grandson was looking at a document with the wrong Jane. redirect it back to Jane Smith (c1872-1955). Fix double redirects. An actual document is found. Jane Smith (c1872-1955) --> Jane Smith (1871-1955). Fix redirects."}, {"type": "paragraph", "text": "Another person has a great grandmother as Jane Smith, but is different from the above, and actually happens to be Jane Smith (1874-1955). They go to create the page, BUT it redirects to a DIFFERENT Jane! What will this new contributor do? They know how to edit pages, but don't know much about redirects. Would the add their Jane's info to THAT Jane, sayinh there's two Janes? Will this person leave the site assuming this site is a personal site? Who knows."}, {"type": "paragraph", "text": "So this is why we should delete those redirects."}, {"type": "paragraph", "text": "Deleting those redirects will allow us to easier create a list of all people articles on one page. This way, I and other people who may wish to help can go to each page and make sure that they are categorized properly and the page name meets our standards. This way, ever single person on this wikia is indexed in where they need to be indexed."}, {"type": "paragraph", "text": "So, we solved these issues. Deleted redirects, create a person list and categorized all those articles. Now we can move ahead:"}, {"type": "list", "elements": [{"text": "Special:Newpages - we can monitor new pages and check that they have the requirements.", "elements": []}, {"text": "Special:Listredirects - we can see all the redirects here.", "elements": []}, {"text": "Special:Logs - we can monitor which pages moved.", "elements": []}]}, {"type": "paragraph", "text": "It is better to solve this problem with having 19,000 articles currently than fixing these issues 2 years from now with perhaps 500,000 articles--on people with 1000s of redirects."}, {"type": "paragraph", "text": "-AMK152) 16:38, 13 February 2008 (UTC)"}], "images": []}, {"title": "Strong disagreement about deleting redirects", "level": 3, "content": [{"type": "paragraph", "text": "If the abovementioned Jane's great grandson creates a link to a page that is in the wrong form, he will blithely create that page and duplicate a lot of work if the redirect with that wrong form has been deleted. Leave it in, so that he will find the right page as soon as he clicks on his new link. Robin Patterson 03:53, 2 July 2008 (UTC)"}], "images": []}]}, {"sections": [{"title": "Wikia tour still worth taking", "level": 1, "content": [{"type": "paragraph", "text": "Have you taken the tour lately?"}, {"type": "paragraph", "text": "Thurstan and I have done some tweaking, and the tour is working just fine. Just a few minutes' worth if you read the commentaries but merely glance at the illustrative pages. Quite a bit longer if you study every page in detail."}, {"type": "paragraph", "text": "Suggestions for additional pages would be welcomed. Qualification: anything that uses {{PAGENAME}} won't work properly but we can have descriptive links to such pages."}, {"type": "paragraph", "text": "-- Robin Patterson (Talk) 09:51, January 1, 2013 (UTC)"}], "images": []}]}, {"sections": [{"title": "Contact", "level": 1, "content": [{"type": "paragraph", "text": "I am not sure of the best way to contact you regarding our possible family connection, so I will hope for the best via this process. My mother's name is Joan Lindauer. I have been trying to research her family and hope that you might be of some help. Her father was named Judd born about 1905 and her grandfather was named Jay. He lived in Watsontown PA died in the flu epidemic of 1918. I would appreciate any additional information you might be able to share. Thank you for all of your hard work."}, {"type": "paragraph", "text": "KT"}], "images": []}]}, {"sections": [{"title": "Data entry without using Form:Person", "level": 1, "content": [], "images": []}, {"title": "Problem", "level": 2, "content": [{"type": "paragraph", "text": "There is sometimes a problem with Form:Person, which we hope to fix within a day or two of becoming aware of it."}, {"type": "paragraph", "text": "The bottom sections of this page will, however, always be useful for people wanting to add a few parameters to an existing page (as suggested on Help:Upgrading old-style person articles, which links to this)."}], "images": []}, {"title": "Example person page", "level": 2, "content": [{"type": "paragraph", "text": "Try this simple version, taken straight from Demo Person. (People who have been using their own may feel inspired to add helpful comments, for the benefit of less experienced users. Thanks to User:Lanica for inspiring me to start this page.) — Robin Patterson (Talk) 03:51, June 27, 2010 (UTC) - amended — Robin Patterson (Talk) 04:37, July 1, 2010 (UTC)"}, {"type": "paragraph", "text": "When you want to add more data to an existing page, you can copy any whole line from below into the page. The order of lines is not important as long as they are all within the right template (i.e. the things that have curly brackets at start and finish). But keeping to the order listed below will make things as easy as possible for later edits. --- Robin Patterson (Talk to me) 07:03, March 5, 2011 (UTC)"}, {"type": "paragraph", "text": "Fairly clean version, which may lose most of its unused parameters as soon as it is published:"}, {"type": "paragraph", "text": "The following version has more detail (and most of us use it little if at all); it looks messy if you leave most of the parameters alone:"}], "images": []}]}, {"sections": [{"title": "Subpages for tree and sensor", "level": 1, "content": [{"type": "paragraph", "text": "Good to see progress on making all of this stuff user-friendly."}], "images": []}, {"title": "Creating tree subpage", "level": 2, "content": [{"type": "paragraph", "text": "The advice we see when clicking on a button that promises to produce a tab to take us to a tree subpage (Create tab:Ancestor tree} is encouraging. I hope it starts working soon."}, {"type": "paragraph", "text": "One is told \"To finish creating the Family tree page, press the save button. After this step you will have to press the Update Sensor button for the tree tab to appear.\". One presses the save button, and maybe a page such as Mary McGregor (1752-1838)/tree appears. Hmmm. One finds one's way back to the edit screen for the person article, with no tab showing. Clicking on the only button that seems to do anything to the sensor page (Update/Create Sensor page) may produce a message like this:"}, {"type": "paragraph", "text": "Error: No page was found at Mary McGregor (1752-1838)/sensor."}, {"type": "paragraph", "text": "No advice about what to do next. There is still no tab leading from her page to her tree."}, {"type": "paragraph", "text": "— Robin Patterson (Talk) 06:15, January 29, 2010 (UTC)"}, {"type": "list", "elements": [{"text": "\"Edit with form\" -> \"Updated/create sensor page\". (watch out for the \"?\" bug).", "elements": []}, {"text": "On the \"sensor\" page there is a \"Create tree\" tab, which you can now use to create the subpage.", "elements": []}, {"text": "now you should get back to the sensor and save it again: the quickest route is probably back to the main page, and back to step 1 above.", "elements": []}]}], "images": []}, {"title": "Format of tree subpage", "level": 2, "content": [{"type": "paragraph", "text": "Needs tweaking? See Jane Means Appleton (1806-1863)/tree, which at present (for me on Firefox 3):"}, {"type": "list", "elements": [{"text": "has Jane's details in a panel that covers about 80% of the page width; a trifle unbalanced, but maybe it shrinks somehow when more generations have details?", "elements": []}, {"text": "doesn't show her mother's mother Mary McGregor (1752-1838), although she and the relevant daughter Elizabeth Means (c1776) both have links going where they should.", "elements": []}]}, {"type": "paragraph", "text": "— Robin Patterson (Talk) 06:15, January 29, 2010 (UTC)"}, {"type": "paragraph", "text": "From today's work on Caddy and Haddy family members, I suspect that the solution requires creating sensor pages and ancestor tabs for all the ancestors. Watch this space. — Robin Patterson (Talk) 04:09, February 13, 2010 (UTC)"}, {"type": "paragraph", "text": "This is getting ridiculous. About 9 hours ago I created the pages for the abovementioned Fred and Sarah. About three hours later I gave her a /sensor page and a /tree page, and later a /picture page. Now when I click on her (RED) link in Fred's \"general\" infobox I get this:"}, {"type": "paragraph", "text": "Add Person: Sarah Annie Haddy (1857) From FamilypediaThe page could not be moved: a page of that name already exists, or the name you have chosen is not valid. Please choose another name, or ask an administrator to help you with the move. Please do not manually move the article by copying and pasting it; the page history must be moved along with the article text."}, {"type": "paragraph", "text": "I ask you! She has a perfectly good article (which I can retrieve from my watchlist or \"Recent changes\"), with the two standard subpages and a /pictures subpage (not that her article shows tabs). Her article was created from that same link on her son's page. Why does it now not go there?"}, {"type": "paragraph", "text": "— Robin Patterson (Talk) 09:14, February 13, 2010 (UTC)"}], "images": []}, {"title": "Progress by January 2011", "level": 2, "content": [{"type": "paragraph", "text": "Some of the above error messages have been eliminated (partly as a result of chaos caused by a software upgrade in March 2010) but the procedures are similar and there's no absolute need to create either the tree page (and/or the descendants page) or the sensor page first. I've now created Help:Tree page. Its talk page can be used to continue this discussion. — Robin Patterson (Talk) 13:10, January 17, 2011 (UTC)"}], "images": []}]}, {"sections": [{"title": "Diagnostics", "level": 1, "content": [{"type": "paragraph", "text": "Bergsmit raises the issue of diagnostics. At the moment we have two:"}, {"type": "list", "elements": [{"text": "Age at death (flag raised if <0 and >110)", "elements": []}, {"text": "Age mother at birth (flag raised if <10 and >60)", "elements": []}]}, {"type": "paragraph", "text": "These show up at the bottom of the page, and problematic values are gathered at Familypedia:Diagnostics."}, {"type": "paragraph", "text": "Questions:"}, {"type": "list", "elements": [{"text": "Do we need to move the diagnostics to a more obvious and prominent place?", "elements": []}, {"text": "Do we need to display a warning at the page if some diagnostics have suspect values?", "elements": []}, {"text": "Do we need more diagnostics?", "elements": []}]}, {"type": "paragraph", "text": "rtol 07:17, September 3, 2009 (UTC)"}, {"type": "paragraph", "text": "We need concrete suggestions. Do you suggest?"}, {"type": "list", "elements": [{"text": "Age father at birth", "elements": []}, {"text": "Age difference between spouses", "elements": []}]}, {"type": "paragraph", "text": "What would be considered problematic? 80? rtol 09:12, September 3, 2009 (UTC)"}, {"type": "paragraph", "text": "I added \"Age father at birth\" rtol 06:29, September 5, 2009 (UTC)"}], "images": []}, {"title": "Reflexivity", "level": 2, "content": [{"type": "paragraph", "text": "I added three more diagnostics. Results at Familypedia:Diagnostics."}, {"type": "paragraph", "text": "The three new tests are \"am I my father's son?\", \"am I my mother's son?\" and \"am I my wife's husband?\". The initial test created loads of false negatives, but I think I have removed these now. The remaining problems seem to be genuine. rtol 10:48, November 2, 2009 (UTC)"}], "images": []}]}, {"sections": [{"title": "Sources to ancestry.com", "level": 1, "content": [{"type": "paragraph", "text": ".... Just to comment on the 'sources' part of an ancestors page. A few that i have an interest in have many links to ancestry.com. These links go to users gedcoms. Could a better 'source' be used? or rather have no sources at all. These ancestry.com gedcoms are often filled with mass copies of everyone elses gedcoms, and is really something i would not rely on."}, {"type": "paragraph", "text": "I'm not sure how all the ancestry links got there as i never added them - if a mod put them there, what is the reason why so many of them have been added, for example, my page on Sarah Ransley has 16 source links to gedcoms from Ancestry.com, and then there is 2 links to actual documents for Sarah, which is as good as it gets."}, {"type": "paragraph", "text": "Excess source links to ancestry - can i delete them?"}, {"type": "paragraph", "text": "Regards, Bobby."}], "images": []}]}, {"sections": [{"title": "Shaligram family", "level": 1, "content": [{"type": "paragraph", "text": "Karnataka state, INDIA"}, {"type": "paragraph", "text": "Hi, we are from Salagrama (not exactly Shaligram) family of Andhra Pradesh , it was known from our ancestors that the family migrated from Karnataka or Maharashtra long back. Gotra is Vashishtasa. vissu8pf@gmail.com"}, {"type": "paragraph", "text": "Shaligram Family --- Presently located in Maharashtra, Brahmins families having Hartas Gothra--"}, {"type": "paragraph", "text": "Kindly contribute the information."}], "images": []}]}, {"sections": [{"title": "Licensing of old family photos?", "level": 1, "content": [{"type": "paragraph", "text": "I have old family photos which were not taken by me and have never been published, and I have been reading through help here and on Central Wikia to determine if I can legitimately upload them and if so under what license. So far I have not found a definitive answer to these questions. If the subject has been discussed here or elsewhere on Familypedia, please point me to that discussion. Otherwise please give me any advice you can. DennisDoty 12:29, 19 April 2009 (UTC)"}], "images": []}]}, {"sections": [{"title": "Charlemagne's descendants", "level": 1, "content": [{"type": "paragraph", "text": "Excellent project. Has anyone else done it apart from Fred's contact (now suffering ill health)?"}, {"type": "paragraph", "text": "Best discussed here rather than spread around user talk pages, I suggest, because a growing number of us will be interested."}, {"type": "paragraph", "text": "I see there's a need for renumbering because someone has discovered a shorter line. Solution to that would have been (and minimising future renumberings would be) to get all of his children sorted, then all of his grandchildren, and so on, and anyone coming off a longer line would be obvious because they would already have the smaller gen number."}, {"type": "paragraph", "text": "Remember the short line from Geo III to Geo VI. I think the error-prone Ancestry.com tends to use the royal line instead."}, {"type": "paragraph", "text": "— Robin Patterson (Talk) 15:57, 9 April 2009 (UTC)"}, {"type": "paragraph", "text": "(Somebody who read this didn't even think to ask about the short line from Geo III to Geo VI.) — Robin Patterson (Talk) 15:03, 27 July 2009 (UTC)"}, {"type": "paragraph", "text": "It is indeed best to work from the early generations onwards, but the current ones are what attracts attention! I'm afraid we'll need a bot to occasionally renumber generations as more lines appear."}, {"type": "list", "elements": [{"text": "{{OrderCharlemagne | N}} puts people in [[Category:Descendants of Charlemagne (Generation N)]]. We could have {{OrderCM | N}} which is shorter but less clear.", "elements": []}, {"text": "{{SovCM | CYear}} puts people in [[Category:Ruling descendants of Charlemagne]] where C is the country code and year is the year of accession. Rtol 18:03, 9 April 2009 (UTC)", "elements": []}]}], "images": []}, {"title": "Generation 2", "level": 2, "content": [{"type": "paragraph", "text": "CM's kids now all have pages and info pages -- the same cannot be said of Wikipedia. This also includes a count of the grandchildren: 26, 19 of whom have a page already. Rtol 10:14, 12 April 2009 (UTC)"}], "images": []}, {"title": "Disputed descendants", "level": 2, "content": [{"type": "paragraph", "text": "Among the 26 grandchildren, 2 are disputed. They are singled out by the * in [[Category:Descendants of Charlemagne (Generation 3)|*]]. Rtol 10:14, 12 April 2009 (UTC)"}, {"type": "paragraph", "text": "I note that for the \"Descendants of Charlemagne\" categories to make any sense, none of the descendants of the disputed people should be categorized as descendants, otherwise we'll need categories like Category:Descendants of Charlemagne (2 disputed links) etc. I notice that the Wikipedia page for Clémence of Aquitaine (1060-1142) implies that it is only a guess that she is the mother of Gerard II van Gelre (c1098-c1131), so there goes a whole branch into the \"disputed\" basket. Thurstan 22:05, 12 April 2009 (UTC)"}], "images": []}, {"title": "Generation 3", "level": 2, "content": [{"type": "paragraph", "text": "Now complete, including a count of the 4th generation: Charlemagne had 45 known great-grandchildren, 4 of whom have a page on Wikia Genealogy. What happened is that people focussed on the lines that lead to England and Holland, and forgot about France, Germany, and Italy. So, putting up generation 4 will restore the geographical balance somewhat. Rtol 07:57, 15 April 2009 (UTC)"}], "images": []}, {"title": "Ruling descendants", "level": 2, "content": [{"type": "paragraph", "text": "I changed the categorization and the templates so that we allow for personal unions. Rtol 18:09, 22 April 2009 (UTC)"}], "images": []}, {"title": "Generation 4", "level": 2, "content": [{"type": "paragraph", "text": "Now complete, including a count of generation 5: 65 (incl. the first double descendant), 15 of which are on Wikia Genealogy. rtol 08:18, 24 April 2009 (UTC)"}], "images": []}, {"title": "Info pages", "level": 2, "content": [{"type": "paragraph", "text": "rtol 21:01, 3 May 2009 (UTC)"}], "images": []}, {"title": "Automation", "level": 2, "content": [{"type": "paragraph", "text": "There is now a semantic test (thanks, Phlox) that automatically categorizes descendants. rtol 10:09, 17 May 2009 (UTC)"}, {"type": "paragraph", "text": "To give most people their lowest possible number as soon as possible, we can concentrate on family lines from the youngest people in each generation. Have we an easy way to see who they are? — Robin Patterson (Talk) 23:20, 23 May 2009 (UTC)"}], "images": []}, {"title": "Generation 5 complete", "level": 2, "content": [{"type": "paragraph", "text": "including a first count of generation 6 (71, 28 of whom are already there)"}, {"type": "paragraph", "text": "however, with auto-categorization (and re-categorization) it is not that important to do this generation by generation and I'll pursue family-lines for a while rtol 20:49, 19 May 2009 (UTC)"}], "images": []}, {"title": "SMW is here too", "level": 2, "content": [{"type": "paragraph", "text": "SMW allows us to show the descendants of anyone without having to create categories. The autocategorization of Charlemagne's descendants has caused a general slowdown of Familypedia."}, {"type": "paragraph", "text": "The plan is therefore as follows:"}, {"type": "list", "elements": [{"text": "Remove the \"Descendant of Charlemagne\" categories;", "elements": []}, {"text": "Create a new category VIA; and", "elements": []}, {"text": "Create a template to show at any page a list of Very Important Ancestors.", "elements": []}]}, {"type": "paragraph", "text": "This plan messes up the bookkeeping of the project to put all Charlemagne's descendants on Familypedia. I therefore created a page Charlemagne (747-814)/project. rtol 05:30, 29 May 2009 (UTC)"}], "images": []}, {"title": "Rate of propagation", "level": 2, "content": [{"type": "paragraph", "text": "Descendants of Charlemagne are now marked by the signature {{Project Charlemagne}} and placed in Category:Descendants of Charlemagne. This autocats. The rate of propagation is good. I started with Charlemagne and Amaudru on June 5. Autocat has found some 160 descendants in five days, and the rate increases with the number of descendants found. rtol 07:44, 10 June 2009 (UTC)"}], "images": []}, {"title": "Generation numbers", "level": 2, "content": [{"type": "paragraph", "text": "Generation numbers are now part of {{Project Charlemagne}}. This is done with a new Property:Order of Charlemagne that will also allow easier queries per generation. Propagation requires a double flush from old to young. rtol 18:30, 19 June 2009 (UTC)"}], "images": []}, {"title": "Cheating", "level": 2, "content": [{"type": "paragraph", "text": "While {{set order of Charlemagne}} can be done manually, it should not. Humans introduce error, and as information percolates so do the errors. Restoring the damage would be a lot of work. rtol 06:39, 27 July 2009 (UTC)"}], "images": []}, {"title": "Visible categories or easy equivalent", "level": 2, "content": [{"type": "paragraph", "text": "I know that this has been raised before, but I was not satisfied with what I understood of the answer. If I want to see which generation one of my relatives is in, I don't want to have to poke around in a list of facts or whatever they are that involve a lot of scrolling and may be different tomorrow. I want to see it in the customary place (a category) or something like the \"project\" logo with a generation specified. On Adolphus, Duke of Cambridge (1774-1850), who has been edited several times since I created his page, there is no logo, a fact that tells me that that system isn't reliable yet. He should have one, because he is a son of George III of the UK, and his descendant George VI of the United Kingdom should have a number based on it, not on George V's number. Maybe I will be sure to see the generation number in the signature panel (or get used to looking for it in a list of facts) when that system settles down and we have all become accustomed to it, but it's not in \"alpha\" mode yet."}, {"type": "paragraph", "text": "Is there any reason why those of us who feel inclined should not add by hand a numbered category to the page of any known descendant?"}, {"type": "paragraph", "text": "— Robin Patterson (Talk) 15:03, 27 July 2009 (UTC)"}, {"type": "paragraph", "text": "The going ons with the Windsors over the last week clearly illustrates the advantages of automation of generation numbers. Last week, Prince William was generation 41. We add the Tecks, and everyone from George VI shifts a generation. We connect the Duke of Edinburgh to the House of Hesse, and Prince Charles shifts two generations. We connect the House of Hannover to the House of Anhalt, and everyone from Prince Frederick Lewis shifts two generations. Manual adjustment would have been a drag."}, {"type": "paragraph", "text": "And there is no reason to believe that Prince William really is generation 38. There is only a handful of lines between generations 6 and 30, and there may well be shorter lines through the House of Saxe or the House of Hesse-Kassel. Other studies are unreliable guides, because they did things manually as well. rtol 00:18, 31 July 2009 (UTC)"}], "images": []}, {"title": "Signature logo", "level": 3, "content": [{"type": "paragraph", "text": "Is there an easy explanation for the occasional appearance of the logo without any generation number? — Robin Patterson (Talk) 13:55, 29 July 2009 (UTC)"}, {"type": "paragraph", "text": "When there is a generation number, I would like it to be a link to the relevant page. Can that be managed easily? — Robin Patterson (Talk) 13:55, 29 July 2009 (UTC)"}], "images": []}, {"title": "Generation 6", "level": 2, "content": [{"type": "paragraph", "text": "Complete. rtol 11:05, September 5, 2009 (UTC)"}], "images": []}, {"title": "April 2010 update", "level": 2, "content": [{"type": "paragraph", "text": "Now that the SMW is settling down nicely, I would like to be able to publicise this project in places such as the soc.gen.medieval mailing list."}, {"type": "paragraph", "text": "But it needs better documentation. Even I don't understand who does the double flushing that has been talked about. I presume that a bot is involved, but I've no idea which bot (perhaps because at least a couple of them don't follow the simple procedures requested) or when it might operate."}, {"type": "paragraph", "text": "The Project Charlemagne page recently proudly stated that generation 8 had been completed and that that all of its children had Familypedia pages. Great! But that same section had a direct link to the /count subpage, which has a table saying that that level and the two immediately preceding it are incomplete. Visitors would get a poor impression if they noticed that; and we want them to read most of the documentation if they are to become useful contributors."}, {"type": "paragraph", "text": "There is still an unanswered question about who says a particular level is complete. The second part of Rule 2 - \"(preferably including several \"source\" links each)\" - is more honoured in the breach than the observance. Where is the documentation showing that two or more authorities agree that Person Xyz had only seven children and noting that we have pages for all seven? As an example, the first listed page for Generation 8, Baldwin IV, Count of Flanders (980-1036), had six double flushes last year, has not been edited in the last 12 weeks, but still has no \"citations\" or external links from which a diligent enquirer might do a spot check to see whether there was any evidence that Familypedia has listed all of Baldwin's children."}, {"type": "paragraph", "text": "Respectful but puzzled --— Robin Patterson (Talk) 14:21, April 4, 2010 (UTC)"}], "images": []}, {"title": "Semi-automatic procedure", "level": 2, "content": [{"type": "paragraph", "text": "In July 2009 rtol said (above) \"You need a double flush as generation number needs to be determined and saved before it can be displayed\". Now he says you don't need double flushes for descent. Something has changed for the better and I don't need to know what."}, {"type": "paragraph", "text": "As I understand from explanations, from examining the code, and from observing what happens in practice:"}, {"type": "paragraph", "text": "So there is a bit of work to be done by users. Those users could include a bot that routinely saved a null edit of every sensor page in Familypedia every now and then."}, {"type": "paragraph", "text": "A bot could be dedicated to this particular project and instructed to go through Descendants of Charlemagne (Generation 10) doing all of those sensor pages then gen 11 then gen 12 and so on. That should get every descendant with the right Order (as far as we know) \"in short order\"."}, {"type": "paragraph", "text": "— Robin Patterson (Talk) 13:17, April 18, 2010 (UTC)"}], "images": []}, {"title": "Citation and documentation", "level": 2, "content": [{"type": "paragraph", "text": "If one's evidence comes from the Web, it takes only a few seconds to paste each source URL into the \"Sources\" box on the person form. If it's from a book, it takes only a few seconds to type the book's shortcut (e.g. {{BPB}}) and page number. — Robin Patterson (Talk) 13:17, April 18, 2010 (UTC)"}], "images": []}, {"title": "By 2011 we still have imperfections", "level": 2, "content": [], "images": []}, {"title": "Too few listings", "level": 3, "content": [{"type": "paragraph", "text": "As I've just commented on the talk page for one of the generations, something has recently gone seriously wrong with the machinery that should pick up and list everyone of a particular generation. Only one person in generation 10, only a couple in each of the next few generations (including one that has one person listed once and one listed three times). Then gen 17 has nobody, which inspired me to change the default message on an earlier generation. Robin Patterson 01:32, February 16, 2011 (UTC)"}], "images": []}, {"title": "Bot use", "level": 3, "content": [{"type": "paragraph", "text": "I've not noticed any response to my suggestion (a few paragraphs above this) that we have \"a bot that routinely saved a null edit of every sensor page in Familypedia every now and then\". Nobody has admitted to operating such a creature, but we still get told that such things happen. What's going on? Robin Patterson 01:32, February 16, 2011 (UTC)"}, {"type": "paragraph", "text": "Two and a half years later, I still have not noticed any sort of reply to my plea. George Neville, 1st Baron Latymer of Snape (c1414-1469) has had order 21 for some time, possibly months, but several of his direct documented-on-FP descendants have been on FP for months if not years and have no order numbers. Example: William Bentinck, 2nd Duke of Portland (1709-1762)/sensor was created 4 years ago and has no order of Charlemagne. If the bot is still running, why is it not spreading the numbers down? If it is not, would somebody please give the rest of us enough information to get it running again? Is there any relevance in the fact that Special:Contributions/Rtolbot shows no action in the last 3 years? -- Robin Patterson (Talk) 01:29, November 1, 2013 (UTC)"}], "images": []}, {"title": "Display of icon", "level": 3, "content": [{"type": "paragraph", "text": "Discontinued. I'd like to see it restored, though I appreciate that it should not be part of the standard page display making more server work for every article load. How about a simple template that users can add to a person's page when they know that the person is a descendant of KtG? The determination of the number would still be programmed, not manual. In rare cases, a disputed link in the chain might mean some person pages continued to show the icon without being entitled to, but that would be a very small number. Robin Patterson 01:32, February 16, 2011 (UTC)"}], "images": []}]}, {"sections": [{"title": "Is Genealogy a Hobby?", "level": 1, "content": [{"type": "paragraph", "text": "It's been a while. I was trying to find this Wikia again. After searching under \"hobby\" and under a couple other headings (which I don't recall right off hand) . . . I only found Genealogy/Family-pedia under \"most popular\" Wikia -- something which a first-time visitor wouldn't know. I hope to be referring some folks here. Is it possible to cross-reference Genealogy into several more categories on the Wikia Index page?"}, {"type": "paragraph", "text": "Just a thought."}, {"type": "paragraph", "text": "Zephyrinus 21:52, 12 February 2009 (UTC)"}], "images": []}]}, {"sections": [{"title": "Census pages", "level": 1, "content": [], "images": []}, {"title": "Introduction", "level": 2, "content": [{"type": "paragraph", "text": "Top of the current list of unwatched pages is 1840 census. It holds an image of part or all of one page of the United States Census, 1840."}, {"type": "paragraph", "text": "But it's possible other countries had a census in 1840. So the page name needs changing at least to something identifying the country and then maybe something saying what aspect of that census it is. (We can then use \"1840 census\" as a disambiguation page (useful when anyone types that into the search box) linking to that one and the others. Robin Patterson 03:50, 30 May 2007 (UTC))"}, {"type": "paragraph", "text": "We are going to get thousands more of these. They will want categorising (by year and country and maybe even by type of record - such as \"extract\", \"index\", ...) and ideally some sort of uniformity in page name."}, {"type": "paragraph", "text": "Robin Patterson 15:21, 10 April 2007 (UTC)"}], "images": []}, {"title": "Page names", "level": 2, "content": [{"type": "paragraph", "text": "Page names are the fiddliest things to change on a page. Can we agree on a standard format?"}, {"type": "list", "elements": [{"text": "1840 U.S. census", "elements": []}, {"text": "Census of U.S. 1840", "elements": []}, {"text": "U.S. census 1840", "elements": []}, {"text": "U.S. 1840 census", "elements": []}, {"text": "?", "elements": []}]}], "images": []}, {"title": "Subpages", "level": 3, "content": [{"type": "list", "elements": [{"text": "1840 U.S. census:Ohio", "elements": []}, {"text": "1840 U.S. census/Ohio", "elements": []}, {"text": "1840 U.S. census/Indexes", "elements": []}, {"text": "1840 U.S. census/Ohio/Indexes", "elements": []}, {"text": "1840 U.S. census/Indexes/Ohio", "elements": []}, {"text": "1840 census of Ohio", "elements": []}, {"text": "1840 census:United States/Ohio", "elements": []}, {"text": "??", "elements": []}]}, {"type": "list", "elements": [{"text": "Source:1920 federal census of Ozark County, Missouri", "elements": []}, {"text": "Source:1920 federal census of Sequoyah County, Oklahoma", "elements": []}, {"text": "Source:1920 federal census, Buchanan County, Virginia", "elements": []}, {"text": "Source:1920 federal census, Dickenson County, VA", "elements": []}, {"text": "Source:1920 federal census, Johnson County, Illinois", "elements": []}, {"text": "Source:1920 federal census, Pike County, Kentucky", "elements": []}, {"text": "Source:1920 population census schedules", "elements": []}, {"text": "Source:1920, 14th United States census, Saline County, Illinois", "elements": []}, {"text": "Source:1921 District Arrangement Listing, Newfoundland", "elements": []}, {"text": "Source:1925 Iowa State census", "elements": []}, {"text": "Source:1925 Iowa census, Buchanan", "elements": []}, {"text": "Source:1925 Iowa census, Jones Co.", "elements": []}, {"text": "Source:1925 Iowa state census index", "elements": []}, {"text": "Source:1925 Queens state census street index", "elements": []}, {"text": "Source:1925 census (of) Ulster County, New York", "elements": []}, {"text": "Source:1925 name only census of Burbank", "elements": []}, {"text": "Source:1926 Tʿvi hamamiutʿenavan marghahamar, 1926-1927", "elements": []}, {"text": ".....", "elements": []}, {"text": "Source:1930 census register : a listing of Family History Library microfilm numbers for the 1930 United States federal census population schedules", "elements": []}, {"text": "Source:1930 census, Kanawha County, West Virginia census (sic) : Elk District", "elements": []}, {"text": "Source:1930 index, Caroline County, Maryland : fifteenth census of the United States", "elements": []}, {"text": "Source:1932 Hopi and Navajo Native American census : with birth and death rolls, 1925-1931", "elements": []}, {"text": "Source:1960 (i.e. 1860) census, Randolph County, Georgia", "elements": []}, {"text": ".....", "elements": []}, {"text": "Source:1st Ward, New York City, census of 1800", "elements": []}, {"text": "Source:200 years of U.S. census taking: population and housing questions, 1790-1990 (548813)", "elements": []}, {"text": "Source:200 years of U.S. census taking: population and housing questions, 1790-1990 (602755)", "elements": []}, {"text": "Source:2o Censo Nacional, 1895 : Cachí, Salta", "elements": []}, {"text": ".....", "elements": []}, {"text": "Source:2o. Censo Nacional, 1895 : General Villegas, Buenos Aires", "elements": []}, {"text": "Source:7th ward, city of Newark, census of 1855", "elements": []}, {"text": "Source:A 1790 census for Wilkes County, Georgia : prepared from tax returns with abstracts of the 1790 tax returns", "elements": []}, {"text": "Source:A Census of Ireland, circa 1659 : with supplementary material from the Poll Money Ordinances (1660-1661)", "elements": []}, {"text": "Source:A Census of households in county Durham, 1563", "elements": []}, {"text": "Source:A Census of pensioners for Revolutionary or military services : with their names, ages, and places of residence, as returned by the marshals of the several judicial (282860)", "elements": []}, {"text": "Source:A Gazetteer of the eighth (1860) census of Iowa", "elements": []}, {"text": "Source:A General index to a census of pensioners for Revolutionary or military service, 1840", "elements": []}]}, {"type": "paragraph", "text": "Standards, anyone?"}, {"type": "paragraph", "text": "Robin Patterson 15:21, 10 April 2007 (UTC)"}], "images": []}, {"title": "Categories", "level": 2, "content": [{"type": "paragraph", "text": "Probably the main category names will follow the main page names."}, {"type": "paragraph", "text": "Ideas, please!"}], "images": []}, {"title": "Zeph's semi-return", "level": 2, "content": [{"type": "paragraph", "text": "I think I gave my input on this with the \"mailing address format\" on another question. Before I even start reading all this (if I dare), has this been resolved? Thanks, Zephyrinus 00:34, 30 May 2007 (UTC)"}], "images": []}, {"title": "Wikipedia pages are a starter", "level": 2, "content": [{"type": "paragraph", "text": "See, for example, United States Census, 1790 and Historical U.S. Census Totals for Franklin County, Massachusetts. We can take some of that material much further, of course, with more emphasis on people than on numbers. State pages in a form such as United States Census, 1790/Connecticut may find favour with Bill and Zeph? Robin Patterson 05:32, 4 July 2007 (UTC)"}], "images": []}, {"title": "US Census", "level": 2, "content": [{"type": "paragraph", "text": "I know you were copying what WP had, but you violated the placename rule. ~ Phlox 16:57, 22 September 2007 (UTC)"}, {"type": "paragraph", "text": "\"Object of [Placename]\""}, {"type": "paragraph", "text": "Proposal- the way I had it. Most significant differentiator first. Time. Use accepted abbreviations UK instead of United Kingdom, same with US to shorten cat names."}, {"type": "paragraph", "text": "1850 Census of the US etc, then subcats for thus and such state & County."}, {"type": "paragraph", "text": "What you will see on the tab list of your browser is Category 1850... Category 1900... Your proposal Category:United S... Category United S...."}, {"type": "paragraph", "text": "Sorry, but you must have thought about this before you did it. Just because WP does something doesn't mean we should. In general, if you want to look at some well thought out categories, take a look at the european cat structures. The US one went first and so they made a lot of mistakes that the others benefited from learning from. We can too.~ Phlox 16:57, 22 September 2007 (UTC)"}], "images": []}, {"title": "no precedents", "level": 3, "content": [{"type": "paragraph", "text": "As far as I know, there are no precedents on placenames specific to census's. There is very little categorization of them on wikis. The precedent I was stating was that the europeans generally have much more rationalized categorization schemes. Not that they are not without peculiarities. For example for some odd reason the French categorize all their art by century using roman numerals, but then mix it with a french ending eg XXieme epoch. Anyway- my main point was \"United States Census\" does not follow the placename pattern. There are censuses. So in the case of censuses do we have an exception? So is it the France Census (Noun form oddness) and the Luxembourgian census (adjective torture)? ~ Phlox 05:51, 23 September 2007 (UTC)"}], "images": []}, {"title": "Census Transcriptions and Images", "level": 2, "content": [{"type": "paragraph", "text": "Bill 13:52, 23 September 2007 (UTC)"}, {"type": "paragraph", "text": "~ Phlox 23:40, 23 September 2007 (UTC)"}, {"type": "paragraph", "text": "As for cat naming, begin at the beginning. Either Genealogy:By location category scheme is the naming convention or it isn't. If it is, then \"United States Census\" violates it. ~ Phlox 23:40, 23 September 2007 (UTC)"}], "images": []}, {"title": "Copying", "level": 3, "content": [{"type": "paragraph", "text": "OK, chaps, I've read the whole of the original judgment as published by Cornell. My impression is that Phlox is close to the truth and Bill is possibly not as close; ie I believe Ancestry would fail if it took court action against Wikia or Commons. The Ancestry images are meant to be faithful reproductions of the originals. Any originality will be in the linkages and search facilities not part of the actual image. And the watermark, while clearly showing the origin, is probably covered by the court's quotation from the Batlin case:"}, {"type": "paragraph", "text": "Out of respect for Ancestry (and its occasional kindness in allowing individuals free trials - though mischievously advertised as \"exclusive\"), the Genealogy Wikia should discourage copying of Ancestry images but should not delete any of them that are uploaded. One may hope that a few are OK as \"fair use\". Wikia management may take a harder line, especially if the number of such copies grows, but that doesn't involve any of us who have not uploaded Ancestry images."}, {"type": "paragraph", "text": "Robin Patterson 03:51, 26 September 2007 (UTC)"}], "images": []}, {"title": "\"Setting up a sequence of articles for systematically displaying census images/transcriptions\"...", "level": 3, "content": [{"type": "paragraph", "text": "I don't think this is a problem. It doesn't significantly increase any temptation to make illegal uploads, above the setting up of the wiki itself. And it may make copyright violations easier to find because of the standardised page names and categories. Each such page may, if we like, include a note at the top encouraging the submission of material that is clearly \"free\". Each page, or the main explanatory pages, should also encourage the creation of links to freely available online images such as USGenWeb (in much the same way as my county pages have links to the appropriate Cyndi's List subpages) rather than the copying of them; freely copiable transcriptions, however, could be usefully reproduced here so as to facilitate linking and searching. Robin Patterson 03:51, 26 September 2007 (UTC)"}], "images": []}, {"title": "Format of page names", "level": 3, "content": [{"type": "paragraph", "text": "Please see and continue discussion at Project talk:By location category scheme. I agree with Phlox on nearly all points, so far. I look forward to seeing whether Bill is interested in expressing views one way or the other, even if (as indicated above) they are not as strong as for \"big ticket\" items. Robin Patterson 03:51, 26 September 2007 (UTC)"}], "images": []}, {"title": "Another perspective", "level": 2, "content": [{"type": "paragraph", "text": "The following discussion has been kindly provided by Cliff Lemere at my request. Cliff has spent considerable time in examining this question in other genealogical context's. I believe what he has to say here is well thought out, and comprehensive. It also matches my own views, but says it much better than I could. In any case, others who read this and the foregoing related discussion, should remember that this entire discussion is an expression of personal viewpoint. If need be we can ask Wikia for their position, which for us would be definitive (though perhaps not for others such as Ancestry. Bill 12:29, 26 September 2007 (UTC)"}, {"type": "paragraph", "text": "As copying public domain materials relevant to genealogy, contributors here should feel completely free to contribute as much as the possibly can- including Census pages. For reasons I have already stated, these fanciful speculations about how it is possible to somehow restrict rights to copy public domain items will be quickly brushed aside by wikia management."}, {"type": "paragraph", "text": "So Bill's comments notwithstanding, No one should have the least hesitation if they wish to embark on such a venture. With that said, even if our wikia had every single page of all the federal censuses, I for one would continue to use ancestry.com because it is not the images themselves that is the asset, but the ability to perform phonetic searches on the content within them. Genealogy wikia would need a specialized search engine for that. But it would be nice for folks to be able to access any page they wished without having to pay one of these sites. ~ Phlox 06:36, 27 September 2007 (UTC)"}, {"type": "paragraph", "text": "Ah, Thank you fr that reminder. However, you've taken it out of context, implying that you were being accused of advancing a personal agenda. Of course, everyone does have personal objectives for everything they do. What I was saying here was simply that I did not know what you were trying to accomplish with this particular effort. Since you haven't responded to that, I'm going to assume that what you intend is to create a space and structure that would foster systematic uploading of materials from databases of organizations such as Ancestry. I believe that would at a minimum be unethical, and at a maximum, violate the licensing agreements underlying those databases. If that's not your intention then there's no problem, however, your above statement statement that"}, {"type": "paragraph", "text": "makes it clear what your personal intent here is: circumventing ancestry's licensing requirements. I do not believe that should be allowed, even if it were found to be legal."}, {"type": "paragraph", "text": "I will also point out that I have not seen any evidence that you have the background or understanding that would allow you to make a statement such as the following:"}, {"type": "paragraph", "text": "Now, in truth, I don't have that kind of back ground either, but then I'm not suggesting we do something in violation of Ancestry's licenseing agreements. You've described your sources for your views as \"authoritative sources\", and pointed to the Commons, with statements that the matter has been discussed \"ad naseum\". If you can point out the specific threads where this has been discussed that would be helpful. As it is, after reviewing the licensing forum archives, I was able to find only a few items that clearly spoke to the question, but those were neither extensive nor authoritative. In any case, what's being done on the Commons withregard to downloads of census images from Ancestry is definitely not what you seem to be going for. The images uploaded to the commons from Ancestry are confined to fewer than a couple of dozen images, and there's no indication that there's any intent to systematically organize that information though extensive categorization schemes etc. So far, what they are doing seems to fall within Ancestry's license. What you are suggesting is quite different."}, {"type": "paragraph", "text": "You've stated"}, {"type": "paragraph", "text": "I suppose some of those folks who respond to questions on the commons might indeed be lawyers, but I don't see any evidence of that, or that they are working for the Commons in their capacity as lawyers. I see little evidence of the kind of carefully thought out argumentation that is typical of lawyers, at least in the discussions related to this problem. From what I can see, these folks seem to be no more authoritative than you or I. Since you are citing these un-named lawyers as your authority, please identify them. Perhaps we can induce them to provide their insight for this discussion."}, {"type": "paragraph", "text": "With regard to your statement that"}, {"type": "paragraph", "text": "I don't know how you would know whether they have been sued or not, though you'd probably have seen some evidence of it in those discussions. However, I suspect that at this point there's no direct case law that speaks to the particular problem we're dealing with here. The absence of case law does not, I believe, mean that there's no problem, only that it hasn't been addressed in the courts."}, {"type": "paragraph", "text": "Bill 12:11, 27 September 2007 (UTC)"}, {"type": "paragraph", "text": "When you have some substance to your claims, rather than just speculative doubts, please record them here. It is a fact that the Commons deletion forum is monitored by foundation lawyers. Feel free to conduct the deletion experiment as I have repeatedly urged you do. The status quo of practice is that these images are copied. You want to change the status quo. OK- but burden of proof is on you to prove your case, not me. You could start, as I suggested much earlier by pointing to any statement that specifically states that census pages may not be copied or republished by other sites. So far, all of this concern is still hypothetical. You haven't even made a case that these sites claim that these images may not be copied. ~ Phlox 16:32, 27 September 2007 (UTC)"}, {"type": "paragraph", "text": "Well, just to keep this short, here are a couple of points."}, {"type": "paragraph", "text": "Bill 16:39, 27 September 2007 (UTC)"}, {"type": "paragraph", "text": "You offer only only your \"opinion\" on why we should believe that the commons example should be ignored. You offer only your \"opinion\" on which to base your assertions of what is allowable under ancestry's license. I'm sorry, but you have only offered speculations, and we are going to have to have more to go on than asking us to simply take your word for it. You have pointed to nothing in the license saying that what you think is allowed is allowed, nor what you think is disallowed is disallowed."}, {"type": "paragraph", "text": "When you take the time to support your argument with facts, then we can discuss it further. There is a well established practice of copying such images, and the burden of proof is on you to show why the practice is illegal. So far you have not even layed a foundation of fact upon which to rest such an argument. ~ Phlox 22:44, 27 September 2007 (UTC)"}, {"type": "paragraph", "text": "I believe Cliff stated the matter quite nicely. As far as opinion is concerned, other than offering a court case that clearly does not apply to the problem, what you have offered is simply your opinion. I've stated that I've searched through the Wiki commons, where you say the issue has been discussed ad naseum, but found very little to support your position. You have been asked to identify the specific statements made there that support your view, and to identify the specific lawyers that you say are reviewing these matters. So far, you have not done so. I presume there is a reason for that. Bill 23:25, 27 September 2007 (UTC)"}, {"type": "paragraph", "text": "It would appear that you clearly did not read and/or comprehend Cliff's original message when he quoted the Ancestry license, which you said he did not. You clearly did not read and/or comprehend when I explained that the images place on the Commons were not an example of the problem. So far people here are doing exactly what people are doing on the commons: Providing images of census images taken from various sources used to support their personal family history. That is something that the Ancestry license permits (which you really do need to read). What the license does not permit is for someone to do exactly what you seem to have in mind. If you aren't going to take the trouble to look at the information being provided, if you aren't going to take the trouble to provide pointers to the discussions you say exist (you've been asked for that several times now), then I have to think that you are simply arguing for the sake of argueing. Bill 00:06, 28 September 2007 (UTC)"}], "images": []}]}, {"sections": [{"title": "Talk about Perry County, Tennessee", "level": 1, "content": [{"type": "paragraph", "text": "Post your inquiries about families, lookup requests, and historical information here."}, {"type": "paragraph", "text": "To start an article on a new subject, please type the subject-matter in the box below and click \"Start New Subject\". Categories should be added to a forum page in the normal way, and will list first if typed right at the top in a separate line."}, {"type": "paragraph", "text": "View recent changes for this forum"}], "images": []}]}]]