[[{"sections": [{"title": "Gucci Asswell BBW Adult Entertainer", "level": 1, "content": [{"type": "paragraph", "text": "submission|d|bio|u=Mizzgucci2014|ns=118|decliner=Huon|declinets=20150531214006|ts=20150531212554}"}, {"type": "paragraph", "text": "Gucci Asswell (born Destiny Rambo, March 30, 1978) is an American pornographic actress and production company Fantasies on Demand [www.gucciasswell.com] owner, from Dallas, Texas. She initially gained fame from the adult section of online advertising company Backpage.com.[1] She started out in 2012 as a BBW dancer/performer. After receiving offers form several porn companies like Busty Baby Dolls and The Phatness, she took a role with ATL Bad Boys, an adult web-based company based out of Florida, in April 2013. The scene starring Gucci Asswell and LEX. Gucci later shot for Evasive Angles in July 2013, starring on the cover of the DVD Big Black Fat Freaks 14."}, {"type": "paragraph", "text": "Gucci now owns her own production company, Fantasies on Demand (F.O.D), [www.gucciasswell.com]an adult web-based company with amateur porn and members.  == References =="}, {"type": "list", "elements": [{"text": "J'Angelo. Exclusive Interview with Gucci Asswell. Sexycraftboots. Retrieved on 24 Nov 2014.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/speedydeletion/images/8/87/Gucci_Asswell_a.k.a._Mizz_Coming_to_Your_City_Soon%21%21%21/revision/latest/scale-to-width-down/335?cb=20150621192346", "caption": "Gucci Asswell a.k.a. Mizz Coming to Your City Soon!!!"}, {"src": "https://vignette.wikia.nocookie.net/speedydeletion/images/5/57/Gucci_Asswell_a.k.a_Mizz_10%27s_%26_20%27s_Houston_TX_10_19_13/revision/latest/scale-to-width-down/335?cb=20150621201449", "caption": "Gucci Asswell a.k.a Mizz 10's & 20's Houston TX 10 19 13"}]}]}, {"sections": [{"title": "ADM formalism", "level": 1, "content": [], "images": []}]}, {"sections": [{"title": "Aleksandar Despić", "level": 1, "content": [], "images": []}]}, {"sections": [{"title": "Anthony G. Bosco", "level": 1, "content": [], "images": []}, {"title": "Infobox template", "level": 2, "content": [{"type": "paragraph", "text": "Greetings, a good match for Infobox would be: Christian leader with Type = Bishop. The CL template appears on hundreds of RC Bishop/Archbishop/Cardinal articles. Regards, JoeHebda (talk) 14:13, 31 March 2015 (UTC)"}], "images": []}]}, {"sections": [{"title": "Babes in the Wood murders (Pine Grove Furnace)", "level": 1, "content": [], "images": []}, {"title": "28 May 2013", "level": 2, "content": [{"type": "paragraph", "text": "This article is intending to discuss the murder of three children in Pine Grove Furnace state park in 1934. While this case likely possesses enough historical credence to belong in Wikipedia, the article posted here requires additional work to meet Wikipedia's style/accuracy requirements. There are currently no sources cited within this article, and much of the article reads as opinion or at the very least journalistic in nature. Furthermore, \"Babe(s) in the Wood\" murders has become too common of a phraseology to be specific to this crime. While it should be referenced within the article that this crime is often cited as an example of a tragic \"Babes in the Wood\" type crime, the title of the crime requires more specificity to be accurately titled within Wikipedia. Thoughts? cwilson (talk) 16:31, 28 May 2013 (UTC)"}], "images": []}]}, {"sections": [{"title": "Adolescent cliques", "level": 1, "content": [], "images": []}]}, {"sections": [{"title": "702 (album)", "level": 1, "content": [], "images": []}]}, {"sections": [{"title": "50 Cent/edithistory", "level": 1, "content": [], "images": []}]}, {"sections": [{"title": "2009–10 Nemzeti Bajnokság I (women's handball)", "level": 1, "content": [], "images": []}]}, {"sections": [{"title": "2007 Boston Mooninite panic/edithistory", "level": 1, "content": [], "images": []}]}, {"sections": [{"title": "1982 Asian Games medal table", "level": 1, "content": [], "images": []}]}, {"sections": [{"title": "Man of Miracles (comics)", "level": 1, "content": [], "images": []}]}, {"sections": [{"title": "Benjamin Lucraft", "level": 1, "content": [], "images": []}, {"title": "Possible copyright issues", "level": 2, "content": [{"type": "paragraph", "text": "It seems to me that this entry in the references section may point to a varying amount of copyright questions!"}, {"type": "paragraph", "text": "\"Family records in the possession of the author.\""}, {"type": "paragraph", "text": "I have already found a sentence plagarised from [1]"}, {"type": "paragraph", "text": "Chaosdruid (talk) 01:00, 11 January 2011 (UTC)"}], "images": []}, {"title": "Original research", "level": 2, "content": [{"type": "paragraph", "text": "... can be transferred here [2] if desired. Jackiespeel (talk) 13:34, 9 February 2015 (UTC)"}], "images": []}]}, {"sections": [{"title": "Agha Shorish Kashmiri", "level": 1, "content": [], "images": []}]}, {"sections": [{"title": "Heat-Ray", "level": 1, "content": [], "images": []}]}, {"sections": [{"title": "Juan Eduardo David Posada", "level": 1, "content": [], "images": []}, {"title": "Cleanup needed", "level": 2, "content": [{"type": "paragraph", "text": "Please see the Cuban artists checklist for background about this article, and please update it with any changes that you make to this article. —72.75.110.142 (talk)"}, {"type": "list", "elements": [{"text": "added 2 references 02:50, 12 March 2008 (UTC)", "elements": []}]}], "images": []}]}, {"sections": [{"title": "Adam Adamowicz", "level": 1, "content": [], "images": []}, {"title": "Untitled", "level": 2, "content": [{"type": "paragraph", "text": "This page shouldn't be deleted do to the fact of his importance in the development of various video games, and ultimately form the culture that our society is based on. Fallout 3 is also a noteworthy game, and their developers should be noted. He has also 7 years of being a veteran in video game development. Tradereddy (talk) 23:06, 19 August 2010 (UTC)"}, {"type": "paragraph", "text": "it absolutely should be deleted. wikipedia is not a collective for every artist and his/her profiles. 203.219.208.78 (talk) 06:26, 11 February 2012 (UTC)"}, {"type": "paragraph", "text": "He created the concept art for Skyrim and Fallout 3, two of the biggest RPGs of the past 5 years. He deserves a page."}, {"type": "paragraph", "text": "Plus he died 4 days ago you heartless fuckers. You think this guy, a genius in his field, DOESN'T deserve a page, let fuckwit whores like 'Snooki' - who let's face it is a piece of fucking shit - gets a page, you are fucking crazy !"}, {"type": "paragraph", "text": "Dude, it's wikipedia, not a memorial page. It seems like you have a personal relationship with Adam which shouldn't cloud your judgement. I personally think there should be an entry for him based on his effect on some very high selling game title, but not because he \"died 4 days ago\". — Preceding unsigned comment added by 38.100.13.66 (talk) 16:55, 13 February 2012 (UTC)"}, {"type": "paragraph", "text": "I kind of have to agree. There are countless concept artists out there. There are countless jobs out there, too, and I'm sure they all mean something to some people, but Wikipedia probably shouldn't keep a record of every person ever lived. People are talking about him because he worked on something very popular... so, by that logic, shouldn't the janitor of Bethesda building also get a page? Or the beta testers for Skyrim all get their own wiki page? — Preceding unsigned comment added by 98.114.57.25 (talk) 05:58, 14 February 2012 (UTC)"}, {"type": "paragraph", "text": "I just came to Wikipedia looking for info on him. I can't think of a better reason to keep a page. 189.78.194.168 (talk) 08:38, 14 February 2012 (UTC)"}], "images": []}, {"title": "Status Quo", "level": 2, "content": [{"type": "paragraph", "text": "Concept artists and game designers are rarely recognized for their art and craftsmanship, and mainly live in the shadows, overworked and underpaid, while millions upon millions look at their art every single day when they turn on a computer or console. More than ten million people have purchased Adam's art, despite the fact that few of them could name him, or even take the time to imagine he exists. It's like little kids who never imagine that their teacher has a house. So I guess it's the status quo to judge Adam as not being notable, despite that his art in form and function has reached millions of people, while Christo hangs an oversized sheet and gets labeled a genius. Yeah, that sounds totally fair, so let's just keep the status quo going.173.166.110.9 (talk) 21:58, 14 February 2012 (UTC)"}, {"type": "paragraph", "text": "oh god hes dead!! noooooooooooo — Preceding unsigned comment added by 99.241.153.196 (talk) 15:54, 15 February 2012 (UTC)"}], "images": []}, {"title": "Obvious bias and weird tone", "level": 2, "content": [{"type": "paragraph", "text": "This article sounds like it was written by the 12 year-old president of this guy's fan club."}, {"type": "paragraph", "text": "\"He had a huge impact on the look, experience, and \"feel\" in Fallout 3, Skyrim, and other BGS (Bethesda Game Studios) games. Both Fallout 3 and Skyrim have been extremely popular games - Skyrim alone has generated over $600 Million (USD) in sales revenue (as of July, 2012).\""}, {"type": "paragraph", "text": "Also, his spouse is \"loner\"? Why even bother including that?"}, {"type": "paragraph", "text": "24.131.177.24 (talk) 01:02, 29 September 2014 (UTC)"}], "images": []}]}, {"sections": [{"title": "Suraj kumar maurya", "level": 1, "content": [{"type": "paragraph", "text": "Bappi Lahiri (Born Alokesh Lahiri on 27 November 1952) is a music composer in the Indian film industry. He popularized the use of synthesized disco music in Indian cinema and sang some of his own compositions. He was popular in the 1980s and 1990s with filmi soundtracks like Wardat, Disco Dancer, Namak Halaal, Dance Dance, Commando, Gang Leader, Sailaab and Sharaabi among others."}, {"type": "paragraph", "text": "Bappi Lahiri joined BJP in 2014. He was declared a BJP candidate from Srirampur in West Bengal for the Indian general election, 2014 and lost."}], "images": []}, {"title": "Biography", "level": 2, "content": [], "images": []}, {"title": "Early years", "level": 3, "content": [{"type": "paragraph", "text": "Bappi D. Lahiri was born in Jalpaiguri, West Bengal. His parents, Aparesh Lahiri and Bansari Lahiri both from Jalpaiguri, West Bengal were famous Bengali singer and musician in classical music and Shyama Sangeet. He is their only child."}, {"type": "paragraph", "text": "He began to play tabla at the age of 3. His maternal relatives include legendary singer Kishore Kumar who was his maternal uncle. Initially he was trained by his parents."}], "images": []}, {"title": "Career", "level": 2, "content": [], "images": []}, {"title": "Hindi films", "level": 3, "content": [{"type": "paragraph", "text": "He moved to Mumbai when he was 19. He received his first opportunity in a Bengali film, Daadu (1972) and the first Hindi film for which he composed music was Nanha Shikari (1973). The first turning point of his career was Tahir Husain's Hindi film, Zakhmee (1975), for which he composed music and doubled as a playback singer. He sang a duet with Mohammed Rafi and Kishore Kumar called \"Nothing Is Impossible\" for the same film."}, {"type": "paragraph", "text": "His first popular film was Chalte Chalte (1976), whose songs became hits thus bringing him recognition as a music director. With Ravikant Nagaich's Surakksha 1979 his singing and music became even more popular. In the early 80s, he added an element of the then popular disco music to his compositions, in movies such as Wardat 1981, Sahhas 1981, Laparwah 1981, Pyara Dushman 1980 song Hari Om Hari, Armaan 1981 song Ramba Ho Samba Ho ."}, {"type": "paragraph", "text": "Mithun Chakraborty and Bappi Lahiri became synonyms of Indian disco culture in the 1980s, largely due to movies such as Disco Dancer.  Bappi Lahiri is the first Music Director to get the China Award in Beijing, China for the film Disco Dancer in 1982.  His song \"Jimmy Jimmy\" was a success in the early 1980s and is said to have achieved some fame in other countries such as Russia.  Some in the media have called him the \"Disco King\" of India, though he has also composed music for some ghazals such as Kisi nazar ko tera intezaar aaj bhi hai for the film Aawaz di hai."}, {"type": "paragraph", "text": "Lahiri entered the Guinness Book of World Records for recording over 180 songs for 33 films in 1986. He used fusion music in a feature film Namak Halaal in the song \"Pagh Ghungroo Bandh Meera Nache Te\", a song 12 minutes long. Lahiri has composed over 5,000 songs in over 500 films in languages including Hindi, Bengali, Tamil, Telugu, Malayalam, Kannada, Gujarati, Marathi, Punjabi, Odia, Bhojpuri, Assamese. He has also composed music for three films made in Bangladesh."}, {"type": "paragraph", "text": "Bappi Lahiri composed the background score for a 1989 Hollywood Film \"Eye Witness to Murder\" which was produced by Vijay Amritraj and Directed by Jagmohan Mundra. He also gave the music for an Indian English language film Divine Lovers which was produced and directed by B.Subhash (Babbar Subhash) in 1997."}], "images": []}, {"title": "Private albums", "level": 3, "content": [{"type": "list", "elements": [{"text": "\"Superuna\" (1982) with Runa Laila was recorded in London", "elements": []}, {"text": "\"Music Lover Dance Dance\" (1985) with Padmini Kolhapuri", "elements": []}, {"text": "\"K Bappi Bappi Moving Away\" (1986) With Krish recorded in London", "elements": []}, {"text": "\"Dancing City\" (1986) with Mandakini", "elements": []}, {"text": "\"Welcome\" (1986) with Anil Kapur, and Salma Agha", "elements": []}, {"text": "\"Little Star\" (1987) with Rema Lahiri", "elements": []}, {"text": "\"Habiba\" (1989) (sung by Bappi Lahiri and his daughter Rema Lahiri)", "elements": []}, {"text": "\"Jawani Jawani\" (1990)", "elements": []}, {"text": "\"Snake Dance\" (1990)", "elements": []}, {"text": "\"Night Lovers\" (1992)", "elements": []}, {"text": "\"Shake Your Body (1993)", "elements": []}, {"text": "\"Heatrave\" (1993)", "elements": []}, {"text": "\"Ala-Li-La\" (1995)", "elements": []}, {"text": "\"Saajan Ke Liye\" (1995)", "elements": []}, {"text": "\"Superema\" (1995) with Rema Lahiri", "elements": []}, {"text": "\"Jungle Boy\" (1995)", "elements": []}, {"text": "\"Yamma Yamma Dance\" (1995) with Usha Uthup and Rema Lahiri", "elements": []}, {"text": "\"Wallah Wallah (1996) with Runa Laila", "elements": []}, {"text": "\"Bappi With Love Remix (1996)", "elements": []}, {"text": "\"One Foot In Heaven, One Foot In Hell\" (1997) Feat. Nine Below Zero", "elements": []}, {"text": "\"Mother of the Nation\" (1998), dedicated to Mother Teresa, which was blessed by Mother Teresa.", "elements": []}, {"text": "Will To Live (1999) with MC Hammer title and singers like Sharon Prabhakar, Asha Bhosle, Kumar Sanu, Rema Lahiri.", "elements": []}, {"text": "\"Festival of light\" (2001) released in London", "elements": []}, {"text": "\"Time 2 Dance\" (2001) recorded in London", "elements": []}, {"text": "\"Bikram's lounge\" (2003) released in USA with Sherrie Payne Freda Payne, with international stars", "elements": []}, {"text": "\"Janta Ki Maang Soniyaji\" (2004) for Congress party)", "elements": []}, {"text": "\"Ghungta\" (2004)", "elements": []}, {"text": "\"Bappiwood remix\" (2003)", "elements": []}, {"text": "Hand to Hand (2005) dedicating the album to the tsunami victims.", "elements": []}, {"text": "\"Yaadein Kaifi\" (2005)", "elements": []}, {"text": "\"V Mobile Singer\" (2006)", "elements": []}, {"text": "\"Kavita Emotional Journey\" (2007) with Rajashree was recorded in USA", "elements": []}, {"text": "\"Ishq Deewana\" (2008)", "elements": []}, {"text": "\"My Love\" (2009)", "elements": []}, {"text": "\"Tribute to The King Of Pop\" (2010) dedicated to Michael Jackson, recorded in Hollywood", "elements": []}, {"text": "\"World Peace Love & Harmony\" (2010) was recorded and released in Hollywood", "elements": []}, {"text": "\"Walking on the Love Street\" (2011) with Diana Williamson, recorded in Hollywood", "elements": []}, {"text": "\"Global Legends\" (2013) recorded and released in Hollywood", "elements": []}, {"text": "\"Justice for Widows\" (2013) Single", "elements": []}, {"text": "\"Bappi's Lounge\" (2014) recorded and released in Hollywood", "elements": []}, {"text": "\"God Is One\" (2014) Gospel album recorded and released in Hollywood", "elements": []}, {"text": "\"Slumstars\" (2015) with slum children, dedicated to slum children", "elements": []}, {"text": "\"Taal Tarang\" (2015) was recorded in Hollywood with guest singer Julia Price", "elements": []}]}, {"type": "paragraph", "text": "Bappi Lahiri has cut two private English albums \"Moving Away\" in 1986 and \"Snake Dance\" in 1990 with songs sung by himself. In 1982, he cut a private Hindi Pop Album titled, \"Superuna\", with songs sung by the Bangladesh singer Runa Laila. This was followed by a private Hindi pop album for Polygram called \"Dance Dance Music Lover\" with Padmini Kolhapure. In 1986, he released \"Welcome\" in London with Anil Kapoor and Salma Agha, and \"Dancing City\" which featured songs by the Hindi actress Mandakini."}, {"type": "paragraph", "text": "Bappi Lahiri introduced his daughter Rema Lahiri in 1987, then 9 years old in a disco version of children's nursery rhymes called \"Little Star\", marketed by HMV. The platinum disc song had an unbroken record for best sales among children section. Based on Michael Jackson's Thriller, Lahiri released a video-pop album titled \"Bappi Lahiri's thriller live\" consisting of eight Hindi songs. He also released albums like \"Dance Party\" sung by his daughter Rema Lahiri in 1990, \"Jawani Jawani\" released by Venus Records & Tapes, \"Night Lovers\" 1992, \"Heatrave\" 1993, \"Yamma Yamma Dance \" with Usha Uthup in 1995, and \"Nine Below Zero\" in 1997. In 2014, he composed two songs for the album Women's Day Special: Spreading Melodies Everywhere, along with Sunil Jha and Shakir Ali. The tracks were penned by Meenu Singh and sung by Sunidhi Chauhan and Rekha Raj respectively."}], "images": []}, {"title": "BL Sound Sanirema Pvt Ltd", "level": 3, "content": [{"type": "paragraph", "text": "In November 1994 Lahiri started his music company, BL Sound (now called B9 Digital Studios Mumbai). He released several CDs under his banner like \"Ala-li-la\" 1995, \"Jungle boy\", \"Super Rema\" sung by his daughter Rema Lahiri, \"Purono jeans\" (Bengali),\"Agnee Prem, \"Hum hai khalnayak\", \"Saajan ke liye\", \"Sraddhanjali amar maa - a tribute to Bansari Lahiri\" (1997) and \"Get on the dance floor\" (a compilation of 8 songs by international singers like Tony Di Bart and Sabrina Johnston)."}], "images": []}, {"title": "Discovering singers", "level": 3, "content": [{"type": "paragraph", "text": "Bappi Lahiri is also a singer and performer of repute on stage. He introduced Disco Songs to Hindi cinema and introduced several Pop Singers like Usha Uthup, Sharon Prabhakar, Alisha Chinai, Parvati Khan, Bali Brahmabhatt, Vijay Benedict, Nandu Bhende, Remo Fernandes, Salma Agha, and film star Anil Kapoor, Amrish Puri, Padmini Kolhapure, Mandakini, and Amjad Khan to sing under his baton. Many prominent singers like Lata Mangeshkar, P.Susheela, Asha Bhosle, Kishore Kumar, Mohammed Rafi, Mukesh, Manna Dey, S. Janaki and the newer generation singers like Kavita Krishnamurthy, Amit Kumar, Kumar Sanu, Udit Narayan, Suresh Wadkar, S.P.Balasubramaniam, Alka Yagnik, Anuradha Paudwal, Shailender Singh, Shabbir Kumar, Mohammad Aziz, Sudesh Bhosle along with Gazal singers Jagjit Singh, Bhupinder Singh and Pankaj Udhas have sung songs composed by Bappi Lahiri in a career spanning for 40 years in over 600 films in over 5000 songs. Bappi Lahiri received an award in 1990 from the then Indian President Giani Zail Singh for the best musical score in the film \"Thanedaar\".  He was invited by Ex-Prime Minister of India, H.D. Deve Gowda, to compose a song for the World Football Tournament in Calcutta at Salt Lake. It was sung by Bappi Lahiri, Udit Narayan, and Rema Lahiri."}, {"type": "paragraph", "text": "Lahiri's wife Chitrani Lahiri produced her first feature film Lal Darja (The Red Door) and which won the 1997 Gloden Lotus award during the 44th National Awards of India. The film, directed by Buddhadev Dasgupta, got the award for being the Best Feature Film Of India."}], "images": []}, {"title": "Style of music", "level": 3, "content": [{"type": "paragraph", "text": "Along with Biddu, Bappi popularized the use of synthesized disco music in Indian cinema with an Indian flavour. Most of his songs werer rendered by singers such as Kishore Kumar and Asha Bhosle as well as new singers like Vijay Benedict and Sharon Prabhakar. He also used Alisha Chinoy and Usha Uthup extensively for his compositions. He created a few hits with the South Indian singer S. Janaki as well."}, {"type": "paragraph", "text": "Some of his music has been sampled by international musicians, such as Dr. Dre, Truth Hurts, and Prodigy, among others. His Disco Dancer (1982) soundtrack is said to have influenced songs by artists such as Charanjit Singh, Devo, Ruki Vverh! Russian Group, and M.I.A.. His most widely sampled song is \"Come Closer\" from Kasam Paida Karne Wale Ki (1984), which has been sampled by various musicians in recent years, including Dabrye, A.G., Planet Asia, \"Zooby Zooby\" Dance Dance Kutmasta Kurt, Masta Ace, eMC, Edu Kehäkettunen, Stig Dogg, and Onra."}], "images": []}, {"title": "Allegations of plagiarism", "level": 3, "content": [{"type": "paragraph", "text": "Throughout his career Lahiri has been accused of plagiarizing music produced by other composers without giving them any credit or royalties."}, {"type": "paragraph", "text": "Conversely, in one instance, portions of his song \"Thoda Resham Lagta Hai\" were included in a 2002 \"Addictive\" by American R&B singer Truth Hurts. Copyright holders Saregama India, Ltd. sued Interscope Records and its parent company, Universal Music Group to the tune of more than $500 million. A Los Angeles federal judge subsequently barred further sales of the CD unless and until Lahiri was listed on the song's credits."}], "images": []}, {"title": "Career Post 1990s", "level": 3, "content": [{"type": "paragraph", "text": "Lahiri disappeared from the Indian film industry in the 1990s though he tried a brief comeback in the Prakash Mehra produced Dalal starring Mithun Chakraborty with the song \"Gutur Gutur\" which was a big hit although it had its share of controversies due to its suggestive lyrics. Thereafter he focussed on bringing out albums with remixes of his earlier songs, such as the 2004 album Bappi Magic - The Asli Baap Mix."}, {"type": "paragraph", "text": "In 2005, he composed the background score for the Jahnu Barua film, Maine Gandhi Ko Nahin Maara, thus reaffirming his identity as a versatile composer. He subsequently lent his svoice to occasional songs such as \"Boombai Nagariya\" for the Vishal-Shekhar movie Taxi Number 9211 and the title track of the Mani Ratnam film Guru."}, {"type": "paragraph", "text": "Since 2006, he has appeared as a judge on popular television shows such as Sa Re Ga Ma Pa L'il Champs on Zee TV with singers Alka Yagnik and Abhijeet. He was a judge for the 2007 edition of Zee TV's Sa Re Ga Ma Pa and Sony Entertainment Television's K For Kishore. In 2010 Lahiri was back with \"I am a disco dancer\" in Golmaal 3 in his own voice. The track was from his previous film Disco Dancer. In 2011, he sang the song Ooo la la Ooo la lain the movie The Dirty Picture for Vishal-Shekhar. He also released an album Walking on Love Street featuring the American Idol contestant Shaun Barrows. The album featured on CMJ's New Music Report Magazine charts, Week World Chart and the WONY Oneonta, New York - Top Ten Jazz Playlist."}], "images": []}, {"title": "Acting", "level": 3, "content": [{"type": "paragraph", "text": "Bappi Lahiri has made guest appearances in several movies. These include the 1974 Kishore Kumar film Badhti Ka Naam Dadhi as Bappu Gipsyan. Later he appeared in P. Sambasiva Rao's movie \"Kalakaar\" 1983 with Kunal Goswami, Sridevi. in 1986 Kirayadar as a musician. In 1988 in Bengali movie \"Nayan Mony\", 1990 Marathi film Dokyala Taap Nahi as a singer. in 1992 in Parto Ghosh Geet with Divya Bharti and Avinash Wadhavan, then in 1993 in Deepak Balraj Vij \"Bomb Blast\" as a singer. Dharma Karma 1997, with Jeetendra. As a friendly appearance in \"Main Hoon Qatil Jaadugarni\" 1998, in 2001 Bappi Lahiri appears in \"Bombay Girls\" as a music director. In Om Shanti Om 2007 Bappi Lahiri as himself. In 2009 Main Aurr Mrs Khanna as Victor with Salman Khan and Kareena Kapoor. Hangover 2010 Bengali movie as a stage performer. Bappi Lahiri also acted in Love.Com... The Ultimate Killing Site (2010) as a singer. In 2012 Bappi Lahiri acted as a Disco composer named DK in \"It's Rocking Dard-E-Disco\" which was produced by Dhumketu."}], "images": []}, {"title": "Personal life", "level": 2, "content": [{"type": "paragraph", "text": "Bappi Lahiri is married to Chitrani since 24 January 1977. They have two children- daughter Rema Lahiri who is also a singer, she got married to a businessman Govind Bansal in February 2009 they have child name Swastik (Rego) Bansal, and son Bappa Lahiri who also became a music director, got married to Tanisha Varma in April 2012. Bappi Lahiri is very fond of jewellery and is usually seen wearing ornaments and dark glasses with a tracksuit."}], "images": []}, {"title": "Selected discography", "level": 2, "content": [{"type": "paragraph", "text": "Some of the movies for which he composed music are:"}, {"type": "list", "elements": [{"text": "Morcha (1980)", "elements": []}, {"text": "Ek Baar Kaho (1980)", "elements": []}, {"text": "Surakshaa (1979)", "elements": []}, {"text": "Wardat (1981)", "elements": []}, {"text": "Armaan (1981)", "elements": []}, {"text": "Chalte Chalte (1976)", "elements": []}, {"text": "Commando (1988)", "elements": []}, {"text": "Ilzaam (1986)", "elements": []}, {"text": "Pyara Dushman (1980)", "elements": []}, {"text": "Disco Dancer (1982)", "elements": []}, {"text": "Dance Dance (1987)", "elements": []}, {"text": "Film Hi Film (1983)", "elements": []}, {"text": "Saheb (1985)", "elements": []}, {"text": "Adventures of Tarzan (1985)", "elements": []}, {"text": "Kasam Paida Karne Wale Ki (1984)", "elements": []}, {"text": "Wanted: Dead or Alive (1984)", "elements": []}, {"text": "Jyoti (1976)", "elements": []}, {"text": "Namak Halaal (1982)", "elements": []}, {"text": "Sharaabi (1984) - Winner 1984 Filmfare Best Music Director Award", "elements": []}, {"text": "Aitbaar (1985)", "elements": []}, {"text": "Zindagi Ek Jua (1992)", "elements": []}, {"text": "Himmatwalla (1983)", "elements": []}]}, {"type": "list", "elements": [{"text": "Hum Tumhare Hain Sanam (2002)", "elements": []}]}], "images": []}, {"title": "Regional films", "level": 3, "content": [{"type": "list", "elements": [{"text": "Nippu Ravva [Telugu]", "elements": []}, {"text": "State Rowdy [Telugu]", "elements": []}, {"text": "Rowdy Alludu [Telugu]", "elements": []}, {"text": "Gang Leader [Telugu] Filmfare Award for Best Music Director - Telugu", "elements": []}, {"text": "Bramha [Telugu]", "elements": []}, {"text": "\"Simhasanam\"\"[Telugu]\"", "elements": []}, {"text": "Krishna Nee Begane Baro - 1986 Kannada Film", "elements": []}, {"text": "Africadalli Sheela - 1986 Kannada Film", "elements": []}, {"text": "Police Mattu Dada - 1999 Kannada Film", "elements": []}, {"text": "The Good Boys - 1997 Malayalam Film", "elements": []}, {"text": "Loafer - Upcoming Bengali film", "elements": []}, {"text": "Love in Mandya - Upcoming Kannada film", "elements": []}]}, {"type": "paragraph", "text": "Bappi Lahiri has also done playback singing for his compositions. Some of the notable songs that he has sung include:"}, {"type": "list", "elements": [{"text": "\"Rahi Hu Mein\" (Wanted: Dead or Alive)", "elements": []}, {"text": "\"Bombai Se Aaya Mera Dost\" (Aap Ki Khatir)", "elements": []}, {"text": "\"Mausam Hai Gaane Ka\" (Surakshaa)", "elements": []}, {"text": "\"Dil Tha Akela Akela\" (Surakshaa)", "elements": []}, {"text": "\"Tum Jo Bhi Ho\" (Surakshaa)", "elements": []}, {"text": "\"Tu Mujhe Jaan Se Bhi Pyaraa hai\" (Wardat)", "elements": []}, {"text": "\"Yaad Aa Raha Hai\" (Disco Dancer)", "elements": []}, {"text": "\"Super Dancer\" (Dance Dance)", "elements": []}, {"text": "\"Jeena Bhi Kya Hai Jeena\" (Kasam Paida Karne Wale Ki)", "elements": []}, {"text": "\"Tera Mera Pehla Yaarana\" (Shart)", "elements": []}, {"text": "\"Pyar Chahiye Mujhe Jeene Ke Liye\" (Manokamna)", "elements": []}, {"text": "\"Raat Baaki\" (Namak Halal)", "elements": []}, {"text": "\"Yaar Bina Chain Kahan Re\" (Saaheb)", "elements": []}, {"text": "\"Tamma Tamma Loge\" (Thaneedar)", "elements": []}, {"text": "\"Pyar Kabhi Kam Nahi Karna\" (Prem Pratigya)", "elements": []}, {"text": "\"Dekha Hai Maine Tumhe Phir Se Palatke\" (Wardat)", "elements": []}, {"text": "\"Dil Main Ho Tum\"", "elements": []}, {"text": "\"Ji Le Le\" (Adventures of Tarzan)", "elements": []}, {"text": "\"Bambai Nagariya\" (Taxi No 9211)", "elements": []}, {"text": "\"Oh la la la\" (The Dirty Picture)", "elements": []}, {"text": "\"To Do Deewar\" (Nirnayak - The Decider)", "elements": []}]}], "images": []}, {"title": "External links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Official website", "elements": []}, {"text": "Bappi Lahiri  at the Internet Movie Database", "elements": []}, {"text": "Bappi Lahiri to get naughty with Katy Perry down south!", "elements": []}]}], "images": []}]}, {"sections": [{"title": "101.Airborne Division Reenactors Group-Hungary", "level": 1, "content": [{"type": "paragraph", "text": "101st Airborne Division Reenactors Group Hungary"}, {"type": "paragraph", "text": "Second World War American Reenactor Association – Hungary"}, {"type": "paragraph", "text": "Our group was founded in 2009 with the aim of keeping the memory of the soldiers of the 101st Airborne Division alive. We intend to authentically present the daily life of the American paratroopers in the battlefields of WW2. Our members are enthusiastics for researching this topic and collecting uniforms and equipment of that age. For attaining the basics of drill and tactics our training camps are organized regularly. We take part in reenacting exhibitions and air shows with pleasure, thus we have the opportunity to provide the public with reliable information in an interesting form. Our group has visited the battlefields of Normandy and Bastogne couple of times. We were invited by the Dead Man’s Corner Museum near St.-Come-du-Mont for presenting a reenactor show and exhibition in 2012. The Second World War American Reenactor Association – Hungary established in 2010 aims at guaranteering the organizational background for our reenacting activities. Our officially registered association coordinates the efforts of the members and is responsible for developing public and foreign relations."}], "images": []}]}]]