[[{"sections": [{"title": "Visionado Serie y peliculas Mundo pokemon", "level": 1, "content": [{"type": "paragraph", "text": "Me moleste en crear un visionado de toda la serie y peliculas ya que no encontre ninguno en internet, y ya que me estoy viendo la serie completa en internet jeje no se si esta bien, creo que tan mal no esta, espero que entre todos saquemos el visionado exacto o el mas a seguir.. ya que muchos que quieran volver a ver la serie desde el principio que lo hagan bien y sin perdidas.. espero les guste la idea y que participen ayudando a finalizar este visionado, me he guiado por la wikiPedia, años de estreno de peliculas y temporadas de la serie."}, {"type": "paragraph", "text": "Nota: recojo el testigo para mejorar el trabajo de mi compañero"}, {"type": "paragraph", "text": "· Comenzamos con Kanto"}, {"type": "paragraph", "text": "- 1ª Temporada - Liga Pokemon (Region Kanto) Completa"}, {"type": "paragraph", "text": "- 1ª Pelicula - mewtwo Vs Mew. La Pelicula"}, {"type": "paragraph", "text": "· Vamos a las Islas Naranjas"}, {"type": "paragraph", "text": "- 2ª Temporada - Liga Naranja (Islas naranja) Completa"}, {"type": "paragraph", "text": "- 2ª Pelicula - El Poder de Uno"}, {"type": "paragraph", "text": "· Entramos en Johto"}, {"type": "paragraph", "text": "- 3ª Temporada - Los viajes de Johto (Region Johto) Completa"}, {"type": "paragraph", "text": "- 4ª Temporada - Los Campeones de la liga Johto (Region Johto) Completa"}, {"type": "paragraph", "text": "- 5ª Temporada - La Busqueda del Maestro (Region Johto) Ver hasta el capitulo 54"}, {"type": "paragraph", "text": "- 3ª Pelicula - Entei el hechizo de los unouws"}, {"type": "paragraph", "text": "- 5ª Temporada - La Busqueda del Maestro (Region Johto) Ver hasta el capitulo 55"}, {"type": "paragraph", "text": "- 4ª Pelicula - Pokemon 4Ever"}, {"type": "paragraph", "text": "- 5ª Temporada - La Busqueda del Maestro (Region Johto) Ver hasta el capitulo 63"}, {"type": "paragraph", "text": "- 5ª Pelicula - Heroes Pokemon"}, {"type": "paragraph", "text": "- 5ª Temporada - La Busqueda del Maestro (Region Johto) Ver el resto"}, {"type": "paragraph", "text": "· Continuamos por Hoenn"}, {"type": "paragraph", "text": "- 6ª Temporada - Fuerza Maxima (Region Hoenn) Completa"}, {"type": "paragraph", "text": "- 7ª Temporada - Reto Maximo (Region Hoenn) Completa"}, {"type": "paragraph", "text": "- 6ª Pelicula - jiriachi y los deseos"}, {"type": "paragraph", "text": "- 8ª Temporada - Batalla Avanzada (Region Hoenn) Completa"}, {"type": "paragraph", "text": "- 7ª Pelicula - Destino Deoxys"}, {"type": "paragraph", "text": "· Caminamos hacia la Frontera"}, {"type": "paragraph", "text": "- 9ª Temporada Batalla de la Frontera (Frontera Kanto) Completa"}, {"type": "paragraph", "text": "- 8ª Pelicula - Lucario y el Misterio de Mew"}, {"type": "paragraph", "text": "· Nos vamos hacia Sinnoh"}, {"type": "paragraph", "text": "- 10ª Temporada - Diamante y perla (Region Sinnoh) Completa"}, {"type": "paragraph", "text": "- 11ª Temporada - Dimension de Batalla (Region Sinnoh) Completa"}, {"type": "paragraph", "text": "- 9ª Pelicula - Pokemon Ranger y el templo del mar"}, {"type": "paragraph", "text": "- 12ª Temporada - Batallas Galacticas (Region Sinnoh) Completa"}, {"type": "paragraph", "text": "- 10ª Pelicula - El desafio de Darkrai"}, {"type": "paragraph", "text": "- 13ª Temporada - Los vencedores de la liga sinnoh (Region Sinnoh) Completa"}, {"type": "paragraph", "text": "- 11ª Pelicula - Giratina y el defensor de los cielos"}, {"type": "paragraph", "text": "· Llegamos a Unova"}, {"type": "paragraph", "text": "- 14ª Temporada - Blanco y Negro (Region Unova) Completa"}, {"type": "paragraph", "text": "- 12ª Pelicula - Arceus y la joya de la vida"}, {"type": "paragraph", "text": "- 15ª Temporada - Destinos Rivales (Region Unova) Completa"}, {"type": "paragraph", "text": "- 13ª Pelicula - El fantasma gobernante zoroark"}, {"type": "paragraph", "text": "- 16ª Temporada - Aventuras en Unova (Region Unova) Completa"}, {"type": "paragraph", "text": "- 14ª Pelicula - NB. Victini y reshiram"}, {"type": "paragraph", "text": "· Continuaremos con X e Y ??"}, {"type": "paragraph", "text": "CLOURPOKET--87.221.7.52 (discusión) 15:09 12 jun 2013 (UTC)"}, {"type": "paragraph", "text": "No me refiero a colgar videos, visionado me refiero a como se debe de ver la serie y las peliculas.. el orden que lleva la historia, es decir primero esta temporada.. que te lleva a que veas esta pelicula luego va la otra temporada.. y eso.. el orden para visualizar la serie (bien comprada o por otros medios en internet) de principio a fin.. ((Visionado = Orden de Series y peliculas)) jeje --87.221.7.52 (discusión) 13:49 13 jun 2013 (UTC)"}, {"type": "paragraph", "text": "relacion no tendran pero no te vas a ver la ultima pelicula y luego la primera temporada.. no tiene ni punto de comparacion.. yo lo he hecho por que creo que a la gente le puede interesar que no te interesa.. borra el post y fuera pero no vengas con tus aires de prepotencia que no me interesan tus opiniones !--87.221.7.52 (discusión) 21:56 14 jun 2013 (UTC)"}, {"type": "paragraph", "text": "Yo he visto películas nuevas de Pokémon sin haber visto ningún capítulo de una temporada reciente y no he tenido problemas para entender su trama. Me parecen interesantes y divertidas y no vi la necesidad de verme media temporada (o varias que no he visto) para entenderla. Aquellos que nacimos con Pokémon y hemos visto varias temporadas sabemos que cada cierto tiempo hacen un borrón y cuenta nueva para que las nuevas generaciones de fans no tengan que ver desde la primera temporada, por lo tanto también te digo que es poco probable que alguien nuevo deba verse todas las temporadas para ver la última película de Pokémon. Lo que sí es que tal vez deba ver películas anteriores, como sucedió con la película de Arceus en donde tuve que ver antes la de Dialga, Palkia, y la de Giratina con Shymin... tal vez alguien deba ver las dos primeras películas de Mewtwo para ver la última, pero no la serie completa y menos desde la primera temporada. --Rodri cyberdog (Discusión)  20:26 20 jun 2013 (UTC)"}], "images": []}, {"title": "Gran sección", "level": 2, "content": [{"type": "paragraph", "text": "Escribo aquí para decir que me ha parecido muy útil esta lista y creo que debería haber una página oficial en la WikiDex en la que se recogiera (y ampliara) todo esto. Aunque yo también he oído que se pueden ver las películas sin ver la serie, lo cierto es que tienen un lugar cronológico concreto dentro del anime, algo fácil de deducir viendo los Pokémon y acompañantes de Ash, además de que hay algunas referencias directas (como el hecho de Mewtwo \"vuelva\" en la primera película después de que se escapara en el anime)."}, {"type": "paragraph", "text": "Me da igual que las películas sean o no canónicas con respecto a la serie, lo cierto es que cada película tiene un lugar concreto dentro del anime y estaría bien hacer una página que registrara esto. A mí esto me ha venido genial para ver las películas en el orden y en el momento adecuado y no encontrarme con la sorpresa de que Ash tiene Pokémon que yo todavía no había visto en la serie o ver a Ash acompañado de personajes con los que ya no estaba en la temporada en la que yo estaba."}], "images": []}, {"title": "Pregunta", "level": 2, "content": [{"type": "paragraph", "text": "Eso es todo o hay mas ? Porque hay mas películas y mas temporadas no la podrías decir?"}, {"type": "paragraph", "text": "Las películas, al ser estas estrenadas en verano equivalen más o menos al final de las temporadas occidentales ya que estas se cortan respecto a la japonesa en verano. El orden que hay puesto es bastante cuestionable. Por ejemplo, ¿Qué pinta Heroes Pokémon en la temporada de Hoenn si aparece Misty y los Pokémon de Johto? Al igual que no tienen ningún sentido ver la de Jirachi por la última de Hoenn cuando aparece, por ejemplo, Torchic y no Combuslen/Blaziken de May/Aura. O la de Pokémon Ranger con Max y Aura/May ponerla en medio de Sinnoh. En definitiva, pese a que son bastante independientes de la serie y uno puede verlas perfectamente (aunque a partir de Sinnoh hay guiños de las películas en el anime, sin contar la primera película), si uno quiere verlas, con el final de temporada es suficiente o si uno quiere hacerlo milimétricamente pues que mire la fecha de la película en el momento que se estrenó el último episodio del anime en Japón.--Dalo (discusión) 23:13 14 ene 2016 (UTC)"}], "images": []}, {"title": "Gracias", "level": 2, "content": [{"type": "paragraph", "text": "Me parece una gran idea, yo estaba buscando esto para poder verme todo pokemon en el mejor orden posible"}, {"type": "paragraph", "text": "ATT: Densort"}, {"type": "paragraph", "text": "Muchísimas gracias por la lista. Justo lo que necesitaba."}, {"type": "paragraph", "text": "ATT: Victor"}, {"type": "paragraph", "text": "por fin encuentro la guía de como ver pokémon en orden muchas gracias"}, {"type": "paragraph", "text": "ATT: BRYAM"}], "images": []}, {"title": "Actualicenlo", "level": 2, "content": [{"type": "paragraph", "text": "deberian actualizarlo a xy, ya salio la nueva generacion, asi que por lo mientras estaria bien saber cuales siguen en cuanto a kalos. Buen post por cierto"}], "images": []}]}, {"sections": [{"title": "Como hago la evolucion de amistad o amor?? Budew", "level": 1, "content": [{"type": "paragraph", "text": "xFavor, quiero saber como hacer evolucionar a mi Budew en un Roselia y al final en Roserade, segun los datos de Budew dice que le gusta lo seco, no se que bayas hay que darle ni cuantas y tambien quiero saber en donde encuentro una roca luz para que al final evolucione en Roserade, un no consigo mi segunda medalla porque aun no llego al pueblo en donde la concigo, lo que digo es que hasta ahorita estoy comenzando con el juego, les agradeceria una pronta respuesta... SERGIO4444 (discusión) 14:57 23 nov 2008 (UTC)SERGIOSERGIO4444 (discusión) 14:57 23 nov 2008 (UTC)"}], "images": []}]}, {"sections": [{"title": "¿que son los IV,s y los Ev,s?", "level": 1, "content": [{"type": "paragraph", "text": "Hola he visto en algunas paginas de internet (y a veces en wikidex ) que aparecen los Iv,s y losEv,s Alguien me podria decir que es y si acaso remplazarlo en las paginas de wikidex que aparezca para que el wiki sea mas facil de entender--Investigador Pokemon (discusión) 19:06 27 may 2011 (UTC)"}, {"type": "paragraph", "text": "Vamos, Ciencia Al Poder ¿cuesta ser servicial? Aunque igual tienes razón, Investigador Pokemon debió haber \"investigado\" antes acerca del tema. Los IVs (Individual Values, o Valores Individuales) y los EVs (Effort Values, o puntos de esfuerzo) son características de un pokémon que hace que sea completamente diferente a los demás. Los IV es un puntaje del 0 al 31 en una característica, ejemplo, ataque. Si el pokémon tiene unos IVs de 31 en ataque (y una naturaleza favorable, y el máximo de EVs en ataque) quiere decir que alcanza lo máximo que puede. Los EVs son una recompensa que ganan los pokémon al derrotar a otro, por ejemplo, si derroto a Arceus, gano 3 EVs en HP, y cuando tenga 4, ¡sube el HP de mi pokémon! De hecho, las vitaminas como el calcio, suben los EVs en 10, y sirven hasta que el pokémon tenga 100. Puedes acumular 255 EVs por característica, y el máximo en total será 510 (es decir, el doble de 255, lo que nos hace sacar en conclusión que podrás tener dos características al máximo)"}, {"type": "paragraph", "text": "¡Rayos, tremenda cátedra que escribí! Si el foro no es para eso..."}, {"type": "list", "elements": [{"text": "Nota: Parece que 1 de cada 1.389.000 (aprox) pokémon tienen todos los IVs en 31.", "elements": []}]}, {"type": "paragraph", "text": "--NEOC (discusión) 21:17 13 jun 2011 (UTC)NEOC"}, {"type": "paragraph", "text": "Si, tienes razón, y yo mismo lo dije: Aunque igual tienes razón, Investigador Pokemon debió haber \"investigado\" antes acerca del tema. Pero igual quería dar mi propia explicación por... afán. Nada más. --NEOC (discusión) 21:17 13 jun 2011 (UTC)NEOC"}, {"type": "paragraph", "text": "NEOC dijo: Nota: Parece que 1 de cada 1.389.000 (aprox) pokémon tienen todos los IVs en 31."}, {"type": "paragraph", "text": "Con un cálculo muy simple (32^6) puedes ver que la probabilidad de que un pokémon tenga 31 en los 6 valores es de 1 entre 1073 millones. Por si te interesa, la probabilidad de que tenga 31 en 4 de las 6 habilidades, siendo éstas exactamente las 4 que prefieras (algo más \"asequible\", y razonable dado que no suele ser útil maximizarlas todas) sería de 1 entre 15.728.640, algo bastante más fácil, aunque prácticamente imposible (es ligeramente más difícil que acertar la primitiva :)"}], "images": []}]}, {"sections": [{"title": "¡Ayuda con los nombres de entrenadores!", "level": 1, "content": [{"type": "paragraph", "text": "Hola, he estado trabajando en una lista de entrenadores, esta: Lista de entrenadores. El caso es que a excepción de los entrenadores de DP donde si pude encontrar una fuente, con el resto no. Por lo tanto los nombres en español que aparecen son basados en los de DP y algunos son traducciones mías. Lo que necesito es que:"}, {"type": "list", "elements": [{"text": "Alguien que lo recuerde que me diga cuales son los nombres de los entrenadores con el ?, este ? quiere decir que si tengo el sprite, pero que no tengo el nombre en español y no puedo subir el sprite con el nombre inglés.", "elements": []}]}, {"type": "list", "elements": [{"text": "Alguien que verifique que aquellos nombres que no viene de DP son verdaderos como por ejemplo: Profesora de OPC.", "elements": []}]}, {"type": "paragraph", "text": "Estaré muy agradecido a quien aporte nombres o por lo menos el lugar donde se encuentran para buscarlos yo. Un saludo, --Profesor Pokémon - Tu dirás 19:03 14 ago 2008 (UTC)"}], "images": []}, {"title": "Nombres", "level": 2, "content": [{"type": "paragraph", "text": "Respecto a este tema, sólo te podría ofrecer la ayuda de poner los nombres que contiene cada entrenador, y sólo en los juegos Rubí, Zafiro y Esmeralda. Por ejemplo, :Bella Gloria. Si eso te sirve de algo, contacta conmigo, y sinó, borra este comentario ^^'."}, {"type": "paragraph", "text": "Un saludo Koenma Ya sabes dónde estoy..."}], "images": []}, {"title": "Yo tambíen te ayudo", "level": 2, "content": [{"type": "paragraph", "text": "Profesor Pokémon, el mejor lugar con spirites (pero en inglés) es en PokéCharms, create tu targeta de entrenador y busca todos los spirites reales que quieras (guárdatelos como imagen y luego haz tu targeta de entrenador, te Serviría el spirite que quieras, y si quieres te cambias la imagen del Pikachu real por la del Spirite del Entrenador (para el de León es el primero y si quieres lo acompañas junto esto, igual con Hikari y Perla. Un Saludotote."}, {"type": "paragraph", "text": "--190.75.226.18 Dudas??? Pregúntame 7:53 16:08:08"}], "images": []}]}, {"sections": [{"title": "¿Como saber cuando un pokemon es de naturaleza favorable?", "level": 1, "content": [{"type": "paragraph", "text": "¿Como puedo saber si un pokemon es de naturaleza favorable?"}, {"type": "paragraph", "text": "Naturaleza ← Allí te aparece todo lo que necesitas saber, pero no podrás conocer la naturaleza de un Pokémon si no lo atrapas. --Ciro GC ~ Talk  09:43 6 dic 2010 (UTC)"}], "images": []}]}, {"sections": [{"title": "Nombre rival de Pokémon Oro/Plata/Cristal ¿Trey o Kamon?", "level": 1, "content": [{"type": "paragraph", "text": "Hola! Tengo una duda respecto a un artículo, y es que yo tenía supuesto que el personaje manga de Pokémon llamado Silver, en realidad se llamaba Kamon, pero he visto que ponía que se llamaba Trey, entonces, ¿por qué se le llama Kamon? ¿cual es su verdadero nombre? Estoy bastante liado, Saludos Elipoke (discusión) 16:43 27 may 2008 (UTC)"}], "images": []}]}, {"sections": [{"title": "Banco Pokémon para Sudamerica?", "level": 1, "content": [{"type": "paragraph", "text": "Perdón, quería saber porque en los bloggs comentan que banco pokemon esta disponible para toda américa si no está disponible en sudamérica."}, {"type": "paragraph", "text": "--190.48.168.57 (discusión) 04:35 7 feb 2014 (UTC)Cacaman3300"}, {"type": "paragraph", "text": "Moviendo tema desde Discusión:Banco de Pokémon#En América del Sur"}, {"type": "paragraph", "text": "Yo en estos momentos estoy en Perú y cuando trate de obtener el Banco Pokémon, me dice que el programa no esta disponible. Creo que salio solo para América del Norte. Si alguien sabe si me equivoco o no, que me informe por favor. -- Infernape Sceptile - The fire is coming (¿Algo que decir?) 23:24 5 feb 2014 (UTC)"}, {"type": "paragraph", "text": "Segun esta noticia ya esta en toda america, soy de españa y no puedo comprobarlo. Es reciente la noticia. --83.41.5.142 (discusión) 18:14 6 feb 2014 (UTC)"}, {"type": "paragraph", "text": "Hola,\nGracias por contactarnos. ¡Me da gusto saber tu entusiasmo por los juegos de Pokémon y que estas disfrutando de los nuevos juegos de Pokémon X/Y! Espero que sigas disfrutando de tus juegos por muchos años. Desafortunadamente, el servicio de Pokémon Bank, en las Américas, sólo estará disponible en los países que tienen acceso a la Nintendo eShop completa (Canadá, EE.UU., México, y Brasil). Esto significa que el servicio de Pokémon Bank no estará disponible en el resto de las Américas.\nDesafortunadamente, ahora mismo, no se encuentra habilitado la Nintendo eShop completa en todos los países de Latinoamérica. Al momento no tenemos información sobre la disponibilidad de la Nintendo eShop en Latinoamérica, si será habilitada en el futuro o no. Entiendo que esta no es la respuesta que esperabas pero como mencione anteriormente, esta es toda la información que tenemos al momento.\nNuevamente agradezco que hayas tomado el tiempo para compartir tus comentarios respecto a Pokémon Bank en Latinoamérica. Puedo entender tus observaciones en cuanto a este tema, y me aseguraré de que tus comentarios se añadirán al registro de comentarios que hemos recibido sobre Pokémon Bank en Latinoamérica y que estén a la disposición de otros departamentos para que los usen de la mejor manera.\nAtentamente,\nNintendo of America Inc.\nAlfonso Arnaiz\nPor lo que si quieres tener el Banco tendrás que cambiar la región de tu Nintendo 3DS y la eShop a alguno de los países mencionados. ¡Saludos! Nano25(:"}], "images": []}]}, {"sections": [{"title": "Gyarados rojo, Pokemon Rojo Fuego", "level": 1, "content": [{"type": "paragraph", "text": "Pasa que estaba pescando tranquila mente cuando aparece un Gyarados Rojo, claramente al lo capture para tenerlo en mi pc del juego. Si bien es cierto este solo aparece en los Pokemon Oro, Plata y Cristal...., la duda que me surge es que es un error del juego o es un pokemon dificil de encontrar ???"}, {"type": "paragraph", "text": "Les dejo la foto en este link: file:///C:/Users/Baquesteich1/Desktop/Gdsfdfy,jm.jpg"}, {"type": "paragraph", "text": "La foto es de mi juego donde esta el Gyarados Rojo"}, {"type": "paragraph", "text": "Danieldhs!"}], "images": []}]}, {"sections": [{"title": "Evolucion nivel 100", "level": 1, "content": [{"type": "paragraph", "text": "hola bueno lo que pasa es que queria saber si se puede evolucionar un pokemon despues de alcanzar nivel 100 pork consegui un chimchar shiny nivel 100 pero me gustaria evolucionarlo a monferno y a infernape se puede? gracias--Torbeaublitogolcro (discusión) 01:22 4 mar 2009 (UTC)"}], "images": []}]}, {"sections": [{"title": "Conseguir a Heracross", "level": 1, "content": [{"type": "paragraph", "text": "Bueno pues, tengo problemas para conseguir a Heracross en Pokémon Crystal."}, {"type": "paragraph", "text": "En la página de Heracross dice que para conseguirlo hay que usar golpe cabeza en las rutas 33, 42 y 44. Sin embargo, si entro a la página de esas rutas, el \"ítem\" que indica que aparece en pokémon crystal está desactivado. ¿Realmente se puede conseguir?"}, {"type": "paragraph", "text": "Otra cosa, en caso de que se pudiera, dice que es cabezeando \"árboles especiales\", ¿cuales son? Y en \"guiasnintendo.com\" dice que se consigue cabezeando rocas, ¿eso es posible? ¿se puede cabezear rocas?"}, {"type": "paragraph", "text": "Gracias de antemano por sus respuestas ^^"}, {"type": "paragraph", "text": "--Majin Buu (discusión) 04:40 30 mar 2011 (UTC)"}, {"type": "paragraph", "text": "Si quieres un consejo, no captures a Heracross, hay muchos más mejor que él. Pero si lo quieres para conseguir todos los Pokémon de la Pokédex, deberías seguir intentandolo en Pueblo Azalea que es más fácil, aunque la proabilidad de que salga es la misma que si golpeas un árbol de esas rutas. Lo de \"cabezear rocas\" será usar golpe roca para partir rocas y que salgan Pokémon. Un saludo del experto en Acero, Roca y Tierra. --Mpl160 (discusión) 13:04 30 mar 2011 (UTC)"}], "images": []}]}, {"sections": [{"title": "Creación de un artículo de como llenar la pokedex", "level": 1, "content": [{"type": "paragraph", "text": "Yo siempre he jugado a los videojuegos y siempre me he preguntado como llenar la Pokedex, lo que no quiero es como obtenerlo, lo que me gustaría que implementen es un artículo en donde describan de forma detallada como VER al pokémon para así llenar la Pokedex. Por ejemplo:"}, {"type": "paragraph", "text": "-Un Venusaur, lo tiene el joven de la ruta 123, pelea contra él y ya lo tendrás en la Pokedex."}, {"type": "paragraph", "text": "Para nada es imposible, yo en el Blanco lo estoy intentando, solo hay que ir a ediciones anteriores e intentar completar la pokedex normal de esa generación, algo bastante fácil, para conseguir un legendario que no aparezca en tu edicion puedes usar la GTS. Despues de hacer eso en el oro/plata, diamante/perla/platino y en el rubi/zafiro/esmeralda es muy fácil, yo ya tengo mas de 550 capturados.--JNT_93 (discusión) 22:27 17 ene 2012 (UTC)"}, {"type": "paragraph", "text": "Pero el tema no trata de llenar la PokéDex capturando pokémon, sino sólo tener las entradas. Por otra parte, lo que dice JNT_93 es verdad (Aunque te equivocaste en algo: ¡Si es casi imposible! ¡Son más de 600 y contando!). Si se quiere tener completa la PokéDex nacional completa en un juego... ¿Qué mejor que completar la PokéDex regional en los juegos anteriores y en el propio juego? Esto es sobretodo más fácil en Nintendo DS, con la GTS. Así sucede lo siguiente:"}, {"type": "list", "elements": [{"text": "Kanto: Completa la PokéDex Regional en Pokémon Rojo Fuego y Verde Hoja. Intercambia TODOS tus Pokémon con Pokémon Rubí, Zafiro y Esmeralda", "elements": []}, {"text": "Hoenn: Completa la PokéDex Regional en Pokémon Rubí, Zafiro y Esmeralda. Intercambia TODOS tus Pokémon con Pokémon Rojo Fuego y Verde Hoja", "elements": []}, {"text": "Sinnoh: Completa la PokéDex Regional en Pokémon Diamante, Perla y Platino. Intercambia TODOS tus Pokémon con Pokémon Oro HeartGold y Plata SoulSilver. Transfiere tus Pokémon de Pokémon Rojo Fuego y Verde Hoja y Pokémon Rubí, Zafiro y Esmeralda en el Parque Compi.", "elements": []}, {"text": "Johto: Completa la PokéDex Regional en Pokémon Oro HeartGold y Plata SoulSilver. Intercambia TODOS tus Pokémon con Pokémon Diamante, Perla y Platino. Transfiere tus Pokémon de Pokémon Rubí, Zafiro y Esmeralda y Pokémon Rojo Fuego y Verde Hoja.", "elements": []}, {"text": "Unova: Completa la PokéDex Regional en Pokémon Negro y Blanco. Transfiere tus Pokémon de Pokémon Diamante, Perla y Platino y Pokémon Oro HeartGold y Plata SoulSilver.", "elements": []}, {"text": "Para tener mejores chances de completar las PokéDex, asegúrate de recibir todos los Pokémon que ofrezcan los demás videojuegos, por ejemplo, el Darkrai de Pokémon Ranger: Sombras de Almia, o el Electivire de Pokémon Battle Revolution. También, asiste o participa en todos los eventos que puedas, como por ejemplo, en febrero se repartirá a Arceus, en Pokémon Negro y Blanco, por ganar una votación. Los eventos del Pokémon Global Link también dan otros Pokémon más comunes, pero que igual pueden faltarte en la PokéDex.", "elements": []}, {"text": "Por último, los Pokémon que te falten, intenta que te los \"preste\" un amigo (intercambiarlo, y luego devolvérselo). Así lo tendrás en la PokéDex, con todos sus datos, y si quieres uno propio para tí, todavía te queda la GTS.", "elements": []}]}, {"type": "paragraph", "text": "Sigue los pasos en orden, y a un paso lento pero seguro completarás tu PokéDex Nacional en todos los juegos. Ten en cuenta que transferir los Pokémon les impide luego volver a su Cartucho o Tarjeta original, así que tienes que estar dispuesto a enviarlos."}, {"type": "paragraph", "text": "Post Data: El único juego donde he completado la PokéDex Regional solamente avistando los pokémon salvajes y de entrenadores fue en Pokémon Diamante. Y resultó faltarme el #151 regional, Manaphy, pero me la consideraron completa."}, {"type": "paragraph", "text": "En otras palabras, mientras más videojuegos de Pokémon juegues, más llena tendrás la PokéDex. Es por eso que estoy coleccionando Cartuchos y Tarjetas de Juego. Ese es el método de oro para completar la PokéDex Nacional. Lástima que no esté al alcance de todos, pero con este consejo podrás progresar algo más."}, {"type": "paragraph", "text": "Nota: Para intercambiar en Pokémon Rubí, Zafiro y Esmeralda y Pokémon Rojo Fuego y Verde Hoja hará falta un cable Link. Para transferir los Pokémon de aquellas ediciones, a Pokémon Diamante, Perla y Platino y Pokémon Oro HeartGold y Plata SoulSilver. Hará falta un Nintendo DS o Nintendo DS Lite. No sirven los Nintendo DSi o Nintendo DSi XL o Nintendo 3DS por carecer de la ranura para cartuchos. Para transferir los Pokémon de los juegos anteriores a Pokémon Negro y Blanco hará falta un segundo Nintendo DS (cualquiera)."}, {"type": "paragraph", "text": "--NEOC -- Avísame de lo que quieras 14:32 18 ene 2012 (UTC)NEOC"}], "images": []}]}, {"sections": [{"title": "Soft reset ¿es seguro?", "level": 1, "content": [{"type": "paragraph", "text": "he estado leyendo lo de los pokemon varicolores. y he leido una parte que ponia SOFT RESET y quiero saber si es seguro. si se hace ¿no le pasa nada al juego? lo digo porque hay algunos trucos que se cargan el juego. ¿este truco esta bien? como le pase algo a mi pokemon blanco... Solduoreu (discusión) 06:53 1 oct 2011 (UTC)"}], "images": []}]}, {"sections": [{"title": "¿Es Rotom uno de los legendarios?", "level": 1, "content": [], "images": []}, {"title": "¿Es Rotom uno de los legendarios?", "level": 2, "content": [{"type": "paragraph", "text": "Hay mucha gente que se hace esa pregunta. Yo, personalmente creo que no, pues es facil de atrapar y puede tener crias y movimientos huevo (a diferencia de los legendarios). He comprobado que puede tener crias y movimientos huevo, por lo que me gustaria asegurarme antes que poner en su pagina que no es legendario, pues en la pagina de Rotom se contradice"}, {"type": "paragraph", "text": "Yo personalmente creo que Rotom no es legendario, porque todos los legendarios están asociados en un campo por ejemplo: Arceus es el pokémon creador, Dialga es el dios del tiempo... Pero siempre hay excepciones, por ejemplo Deoxys, que no se le cree como un dios, ya que es la mutación de un virus alienígena. --L3xTu (discusión)"}, {"type": "paragraph", "text": "Yo estoy en duda, pienso que más que legendario, es mítico, como Snorlax o Unown. Mis dudas es por esto:"}, {"type": "list", "elements": [{"text": "Solo hay uno (en estado salvaje)", "elements": []}]}, {"type": "list", "elements": [{"text": "La música es distinta, no estoy muy seguro pero creo que es la de los legendarios.", "elements": []}]}, {"type": "list", "elements": [{"text": "En la Pokédex está en el lugar de los legendarios.", "elements": []}]}, {"type": "paragraph", "text": "--Con Carne (discusión) 10:32 28 jun 2009 (UTC)"}, {"type": "paragraph", "text": "No es legendario aunque suene la musica de los Pokémon legendarios cuando combates contra él.-----RIOLU--- (discusión) 21:10 30 ago 2009 (UTC)"}, {"type": "paragraph", "text": "yo creo que si pues te lo capturas despues de la liga,pero no es tan importante sara."}, {"type": "paragraph", "text": "Desde que tengo memoria y la introducción de Rotom, quedó claro que no es Legendario. El hecho de poner o no huevos puede ser una de las distinciones, aunque cuando se dá el caso y es legendario, se especifica, como en el caso de Manaphy."}, {"type": "list", "elements": [{"text": "Existe más de un Rotom en el juego, esta la posibilidad de capturar tantos como desees en X&Y.", "elements": []}, {"text": "En los eventos que excluyen legendarios por parte de Nintendo, no excluyen a Rotom.", "elements": []}, {"text": "Salvo que este explicito en cualquier publicación por parte de Nintendo o juego de Pokemon, este seguirá siendo un pokemon normal o raro de encontrar.", "elements": []}]}, {"type": "paragraph", "text": "Más importante aún: Rotom NO APARECE en la lista de legendarios para X&Y publicados en este articulo, propio de la franquicia: http://www.pokemonxy.com/en-us/pokemon/legendary_pokemon/"}, {"type": "paragraph", "text": "--Alesk8ter (discusión) 18:15 11 oct 2017 (UTC)"}], "images": []}]}, {"sections": [{"title": "Como se calcula los puntos IV AYUDA?????", "level": 1, "content": [{"type": "paragraph", "text": "Me podrian decir como se calculan porfavor."}], "images": []}]}, {"sections": [{"title": "¿Como cambio el nombre de mi usuario o como se borra?", "level": 1, "content": [{"type": "paragraph", "text": "Ahora que lo pienso quiero saber como se cambia el nombre de mi usuario o como se borra, alguien que me ayude por favor."}], "images": []}]}, {"sections": [{"title": "Trampas de Subsuelo Sinooh", "level": 1, "content": [{"type": "paragraph", "text": "NO puedo liberarme de las trampas en el subsuelo en el juego de diamante y perla. Qué debo hacer?"}, {"type": "paragraph", "text": "Fernando"}, {"type": "paragraph", "text": "Gracias por las respuestas. Tienen mucha razón que se debería escribir un artículo con las trampas del subsuelo"}], "images": []}]}, {"sections": [{"title": "Vestidura", "level": 1, "content": [{"type": "paragraph", "text": "hola"}, {"type": "paragraph", "text": "tengu una pregunta sobre el objeto Vestidura, al llevarlo equipado la cantidad de puntos de esfuerzo se duplica a costa de la velocidad, ¿esto se refiera a que mientras el pokémon lo lleve equipado sera más lento? o ¿se refiera a que aun cuando ya no lo tenga, la velocidad del pokémon se seguira viendo reducida y por lo tanto sera más lento?."}, {"type": "paragraph", "text": "Gracias--henri (discusión) 04:21 25 nov 2008 (UTC)"}], "images": []}]}, {"sections": [{"title": "El mapa del mundo pokemon (con todas las regiones)", "level": 1, "content": [{"type": "paragraph", "text": "hola, qiero saber si alguien tiene un mapa del mundo pokemon ke salgan todas las regiones (kanto, johto, hoenn, aura y sinnoh)si algien lo tiene ke loponga aki plis--Buckfire 23 (discusión) 09:19 6 dic 2008 (UTC)"}], "images": []}, {"title": "yo", "level": 2, "content": [{"type": "paragraph", "text": "yo tengo uno pero si quieres pidemelo por mail y te lo paso askaban_26@hotmail.com no se si venga aura pero las demas si"}], "images": []}]}, {"sections": [{"title": "Frase de Pueblo Azuliza", "level": 1, "content": [{"type": "paragraph", "text": "He visto que en Wikidex en la página de Pueblo Azuliza dicen que la frase del club hay que cambiarla para capturar a Feebas, pero no incluyen qué hacer el jugador en una situación un tanto complicada como la mía."}, {"type": "paragraph", "text": "El chico que cambia las frases de moda, yo le digo la frase de moda nueva, pero él no la quiere cambiar y siempre dice que la frase (que por cierto es Feebas Carvanha, así la puso el juego) está más \"in\" y le parece que es mejor que la frase que yo le estoy diciendo."}, {"type": "paragraph", "text": "Y con todas las frases que pruebo hace lo mismo. ¿Por qué?"}, {"type": "paragraph", "text": "Lauraps90 (discusión) 04:35 18 may 2011 (UTC)Lauraps90"}, {"type": "paragraph", "text": "Si no puedes \"reparar\" tu cartucho con ninguna de las formas que se describen en Nintendo o en el artículo por \"x\" motivo, también puedes acostumbrarte a esa frase (Feebas Carvanha) porque no podrás hacer la que tenías antes y que sabías. En todo caso, si necesitas un Feebas, pero ya tenías uno (me refiero a Feebas, por supuesto) o un Milotic, lo mejor que podrías hacer (y lo mas sencillo) sería criar uno en la guardería. --NEOC (discusión) 01:26 16 jun 2011 (UTC)NEOC"}], "images": []}]}, {"sections": [{"title": "Duda objetos potenciadores", "level": 1, "content": [{"type": "paragraph", "text": "Hola me surgió una duda con los objetos potenciadores ya que en todos dice que hasta la tercera generación subía cierto porcentaje y luego de la tercera generación otro porcentaje. Pero no se cuanto suben en la tercera generación. Por ejemplo el Incienso marino en pokemon rojo fuego o verde hoja sube 5% o 20%. Y agua mística sube 10% o 20%? Muchas gracias"}], "images": []}]}]]